{
  "user": "acolomba",
  "name": "blackvuesync",
  "namespace": "acolomba",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Synchronizes recordings from a BlackVue dashcam with a local directory over a LAN.\n",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 222338,
  "last_updated": "2022-08-21T16:02:52.154069Z",
  "date_registered": "2018-11-24T22:14:50.851986Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "acolomba",
  "has_starred": false,
  "full_description": "# BlackVue Sync\n\nSynchronizes recordings from a BlackVue dashcam with a local directory over a LAN.\n\nBlackVue dashcams expose an HTTP server that can be used to download all recordings. This project downloads only recordings that are not already downloaded, optionally limiting downloads in a local directory to a date range.\n\nA typical setup would be a periodic cron job or a Docker container running on a local server.\n\n## Features\n\n* *Portable runtimes:*\n  * A [single, self-contained Python script](https://github.com/acolomba/blackvuesync/blob/master/blackvuesync.py) with no third-party dependencies. It can be copied and run anywhere, either [manually](#manual-usage) or [periodically](#unattended-usage).\n  * A [docker image](#docker) that runs periodically via an internal cron job.\n* *Smart*: Only downloads recordings that haven't already been downloaded.\n* *Resilient*: If a download interrupts for whatever reason, the script resumes where it left off the next time it runs. This is especially useful for possibly unreliable Wi-Fi connections from a garage.\n* *Hands-off*: Optionally retains recordings for a set amount of time. Outdated recordings are automatically removed.\n* *Cron-friendly*: Only one process is allowed to run at any given time for a specific download destination.\n* *Safe*: Stops executing if the destination disk is almost full.\n* *Friendly error reporting*: Communicates a range of known error conditions with sensible verbosity.\n\n## Prerequisites\n\n### Software\n\n* [Python](https://www.python.org/) 3.5+ or [Docker](https://docs.docker.com/).\n* Sufficient disk space on a file system local to the script. Plan for about 5GB/hr per camera.\n* [BlackVue Viewer](https://blackvue.com/kr/download/) or a media player to view the recordings.\n\n### Hardware\n\nA cloud-enabled [BlackVue](https://www.blackvue.com/) dashcam must be connected via Wi-Fi to the local network with a _static_ IP address.\n\nThe dashcam must be kept powered for some time after the vehicle is turned off. BlackVue offers these accessories to draw power from the vehicle for a configurable amount of time:\n\n* [Power Magic EZ](https://blackvue.com/?post_type=wc_product_tab&p=121481): Plugs into the OBD port.\n* [Hardwiring Kit](https://blackvue.com/product-category/add-ons/hardwiring-kit/): Plugs into the fuse box.\n\nThe power-on timer should be set to a duration sufficient for recordings to be downloaded. Consult the dashcam manual for the bit rate for your chosen image quality, and compare it with the download speed reported by BlackVue Sync.\n\nExample with a DR750S-2CH recording with two cameras at the highest quality setting and a good but conservative download speed:\n\n```calca\n# dashcam bitrates\ndashcam_bitrate_front = 12Mbps\ndashcam_bitrate_back = 10Mbps\ndashcam_bitrate = dashcam_bitrate_front + dashcam_bitrate_back\n\ndownload_speed = 20Mbps\n\n# hours on the timer for every hour of recording\nratio = dashcam_bitrate / download_speed => 1.1\n```\n\n### Verifying Connectivity\n\nFor illustration purposes, all examples assume that the camera is reachable at the `dashcam.example.net` address. A static numeric IP address works just as well.\n\nA quick way to verify that the dashcam is online is by using `curl`.\n\n```sh\n$ curl http://dashcam.example.net/blackvue_vod.cgi\nv:1.00\nn:/Record/20181026_135003_PF.mp4,s:1000000\nn:/Record/20181026_140658_PF.mp4,s:1000000\nn:/Record/20181026_140953_PF.mp4,s:1000000\n...\n$\n```\n\nAnother way is by browsing to: `http://dashcam.example.net/blackvue_vod.cgi`.\n\n## Usage\n\n### Manual Usage\n\nThe dashcam address is the only required parameter. The `--dry-run` option makes it so that the script communicates what it would do without actually doing anything. Example:\n\n```sh\nblackvuesync.py dashcam.example.net --dry-run\n```\n\nIt's also possible to specify a destination directory other than the current directory with `--destination`:\n\n```sh\nblackvuesync.py dashcam.example.net --destination /data/dashcam --dry-run\n```\n\nA retention period can be indicated with the `-keep` option. Recordings prior to the retention period will be removed from the destination directory. Accepted units are `d` for days and `w` for weeks. If no unit is indicated, days are assumed.\n\n```sh\nblackvuesync.py dashcam.example.net --destination /data/dashcam --keep 2w --dry-run\n```\n\nA typical invocation would be:\n\n```sh\nblackvuesync.py dashcam.example.net --destination /data/dashcam --keep 2w\n```\n\nOther options:\n\n* `--grouping`: Groups downloaded recordings in directories according to different schemes. Grouping speeds up loading recordings in the BlackVue Viewer app. The supported groupings are:\n  * `daily`:  By day, e.g. 2018-10-26;\n  * `weekly`: By week, with the directory indicating the date of that week's monday, e.g. 2018-10-22;\n  * `monthly`: By month, e.g. 2018-10;\n  * `yearly`: By year, e.g. 2018;\n  * `none`: No grouping, the default.\n* `--priority`: Downloads recordings with different priorities: `date` downloads oldest to newest; `rdate` downloads newest to oldest; `type` downloads manual, event (all types), normal and (non-event) parking recordings in that order. Defaults to `date`.\n* `--max-used-disk`: Downloads stop once the specified used disk percentage threshold is reached. Defaults to `90` (i.e. 90%.)\n* `--timeout`: Sets a timeout for establishing a connection to the dashcam, in seconds. Defaults to `10.0` seconds.\n* `--quiet`: Quiets down output messages, except for unexpected errors. Takes precedence over `--verbose`.\n* `--verbose`: Increases verbosity. Can be specified multiple times to indicate additional verbosity.\n\n### Unattended Usage\n\n#### Plain cron\n\nThe script can run periodically by setting up a [cron](https://en.wikipedia.org/wiki/Cron) job on UNIX systems.\n\nSimple example with crontab for a hypothetical `media` user:\n\n```crontab\n*/15 * * * * /home/media/bin/blackvuesync.py dashcam.example.net --keep 2w --destination /data/dashcam --cron\n```\n\nThe `--cron` option changes the logging level with the assumption that the output may be emailed. When this option is enabled, the script only produces logs when it downloads recordings and when it encounters unexpected errors. One would typically see an email only after driving or when something goes wrong.\n\nNote that if the dashcam is unreachable for whatever reason, in `--cron` mode no output is generated, since this is an expected condition whenever the dashcam is away from the local network.\n\nIf cron jobs overlap, the script recognizes that another instance is currently running via a lock file on the destination directory. For the lock to work correctly, the destination directory must be on a local filesystem relative to the script.\n\n#### NAS\n\nMany NAS systems allow running commands periodically at set intervals.\n\n##### openmediavault\n\nThe [openmediavault](http://www.openmediavault.org/) NAS solution allows running [scheduled jobs](https://openmediavault.readthedocs.io/en/latest/administration/general/cron.html) with support for mail notifications.\n\nExample:\n\n![openmediavault Scheduled Job](https://raw.githubusercontent.com/acolomba/blackvuesync/master/docs/images/cron-example-openmediavault.png)\n\n#### Docker\n\n##### Overview\n\nThe [acolomba/blackvuesync](https://hub.docker.com/r/acolomba/blackvuesync/) docker image sets up a cron job internal to the container that runs the synchronization operation every 15 minutes.\n\n##### Quick Start\n\nIt's a good idea to do a single, interactive dry run first with verbose logging:\n\n```sh\ndocker run -it --rm \\\n    -e ADDRESS=dashcam.example.net \\\n    -v $PWD:/recordings \\\n    -e DRY_RUN=1 \\\n    -e VERBOSE=1 \\\n    -e RUN_ONCE=1 \\\n    --name blackvuesync \\\nacolomba/blackvuesync\n```\n\nOnce that works, a typical invocation would be similar to:\n\n```sh\ndocker run -d --restart unless-stopped \\\n    -v /data/dashcam:/recordings \\\n    -e ADDRESS=dashcam.example.net \\\n    -e PUID=$(id -u) \\\n    -e PGID=$(id -g) \\\n    -e TZ=\"America/New_York\" \\\n    -e KEEP=2w \\\n    --name blackvuesync \\\nacolomba/blackvuesync\n```\n\n##### Docker Compose\n\n[Docker Compose](https://docs.docker.com/compose/) may offer an easier, more repeatable and extensible option for running a BlackVueSync Docker container.\n\nAfter downloading the Docker [Compose file](https://raw.githubusercontent.com/acolomba/blackvuesync/main/docker-compose.yml) and editing its values as desired, BlackVueSync can be started with:\n\n```sh\ndocker-compose up -d\n```\n\nOR, depending on the Docker version:\n\n```sh\ndocker compose up -d\n```\n\n##### Reference\n\nThese options are required for the docker image to operate correctly:\n\n* The `/recordings` volume mapped to the desired destination of the downloaded recordings.\n* The `ADDRESS` parameter set to the dashcam address.\n* The `PUID` and `PGID` parameters set to the desired destination directory's user id and group id.\n* The `TZ` parameter set to the same [timezone](https://en.wikipedia.org/wiki/List_of_tz_database_time_zones) as the dashcam. Note that BlackVue dashcams do not respect Daylight Savings Time, so their clock needs to be adjusted periodically.\n\nOther parameters:\n\n* `GROUPING`: Groups downloaded recordings in directories, `daily`, `weekly`, `monthly`, `yearly` and `none` are supported. (Default: `none`.)\n* `KEEP`: Sets the retention period of downloaded recordings. Recordings prior to the retention period will be removed from the destination. Accepted units are `d` for days and `w` for weeks. If no unit is indicated, days are assumed. (Default: empty, meaning recordings are kept forever.)\n* `PRIORITY`: Sets the priority to download recordings. Pick `date` to download from oldest to newest; pick `rdate` to download from newset to oldest; pick `type` to download manual, event (all types), normal and (non-event) parking recordings in that order. Defaults to `date`.\n* `MAX_USED_DISK`: If set to a percentage value, stops downloading if the amount of used disk space exceeds the indicated percentage value.  (Default: `90`, i.e. 90%.)\n* `TIMEOUT`: If set to a float value, sets the timeout in seconds for connecting to the dashcam. (Default: `10.0` seconds.)\n* `VERBOSE`: If set to a number greater than zero, increases logging verbosity. (Default: `0`.)\n* `QUIET`: If set to any value, quiets down logs: only unexpected errors will be logged. (Default: empty.)\n* `CRON`: Set by default, makes it so downloads of normal recordings and unexpected error conditions are logged. Can be set to `\"\"` to disable.\n* `DRY_RUN`: If set to any value, makes it so that the script communicates what it would do without actually doing anything. (Default: empty.)\n* `RUN_ONCE`: If set to any value, the docker image runs the sync operation once and exits without setting up the cron job. (Default: empty. Not supported in Docker Compose.)\n\n## License\n\nThis project is licensed under the MIT License - see the [COPYING](COPYING) file for details\n\nCopyright 2018-2022 [Alessandro Colomba](https://github.com/acolomba)\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}