{
  "user": "andresch",
  "name": "trackfs",
  "namespace": "andresch",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "A FUSE filesystem for extracting individual tracks from album files (flac or wave).",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 1866,
  "last_updated": "2021-02-28T20:04:45.560426Z",
  "date_registered": "2020-12-28T22:26:54.355619Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "andresch",
  "has_starred": false,
  "full_description": "\n`trackfs`\n=======\n\n`trackfs` is a read-only FUSE filesystem that splits audio files that contain full albums into individual FLAC files per track.\n\n`trackfs` supports three flavors of album files:\n* FLAC files with embedded cuesheets (FLAC+CUE)\n* FLAC files with accompanying cuesheet\n* WAVE files with accompanying cuesheet\n\nAccompanying cuesheets must use the fileextension `.cue` and have the same basename as album file.\n\nThe recommended way to use `trackfs` is using the docker image `andresch/trackfs`. In case you want to use `trackfs` without docker see section [Manual Installation](https://github.com/andresch/trackfs#manual-installation) below.\n \nUsage\n-----\n\nYou can directly run `trackfs` on any Linux system with Docker and FUSE installed.\n\n### Getting started\n\nThe simplest way to get familiar with `trackfs` is to just launch it from the command-line:\n\n```\ndocker run --rm \\\n    --name=trackfs \\\n    --device /dev/fuse \\\n    --cap-add SYS_ADMIN \\\n    --security-opt apparmor:unconfined \\\n    -v /path/to/yourmusiclibrary:/src:ro \\\n    -v /path/to/yourmountpoint:/dst:rshared \\\n    andresch/trackfs \\\n    --root-allowed\n```\n\nReplace `/path/to/yourmusiclibrary` with the root directory where `trackfs` scans for your album files and `/path/to/yourmountpoint` with the directory that you want to use as mount point for the `trackfs`-filesystem. Ideally the mount point already exists, if not, docker will create the directory (but then with root as owner)\n\nOnce started you will find all directories and files from your music library also in the `trackfs`-filesystem. Only album files got replaced: Instead of a single album file you will find individual FLAC files for each track found in the cue sheet. The track-files will have the following names:\n\n    {album-file}.#-#.{tracknumber}.{track-title}.flac\n\nWhile the tracks can be used like regular files, they don't exist in the physical file system on your machine. Instead `trackfs` creates them on the fly whenever an application starts loading any of the track files. This usually takes (depending on your system) a few seconds.\n\n#### Docker arguments\n\nIn case you're not familiar with docker, a quick explanation on the used docker arguments:\n\n* `-v /path/to/yourmusiclibrary:/src:ro`: make your music library accessible for trackfs by mounting it to /src in read-only mode inside your docker container\n* `-v /path/to/yourmountpoint:/dst:rshared`: share the trackfs filesystem (`/dst` inside the container) accessible under your mount point\n* `andresch/trackfs`: the name of the `trackfs` docker image on docker hub.\n* `--device`, `--cap-add` `--security-opt`: With those arguments you grant the docker container the privileges required to mount FUSE filesystems. You can try to leave out the `--security-opt` option as it is not required on all systems. There is [onging discussion](https://github.com/docker/for-linux/issues/321) if docker containers should allow mounting FUSE filesystems, by just using the `--device` option, but for now this is not the case.\n* `--rm`: remove the orphaned container after termination\n\nPlease refer to the [docker run documentation](https://docs.docker.com/engine/reference/commandline/run/) for more details.\n\n### Running `trackfs` as regular user \n\nWhile the above is working just fine, it is not the recommended way to use `trackfs` as it runs `trackfs` inside the docker container as user root. Running as root does allow `trackfs` to access any file in your music library, irrespective of its underlying file permissions. If we would have omitted the `--root-allowed` argument, `trackfs` would have terminated with a corresponding error message.\n\nInstead it is recommended to let `trackfs` run as a regular user. For that to work we need a few changes:\n- Make sure that in your host system the file `/etc/fuse.conf` has the option `user_allow_other` enabled, e.g. by calling from your command line \n  ```sudo echo \"user_allow_other\" >> /etc/fuse.conf```\n- Make sure that your mount point already exists and is owned by the user that is supposed to run `trackfs`.\n- Use the docker run option `--user` to define the user that will run `trackfs` \n\n  E.g. the following docker command would run `trackfs` with the current user:\n\n  ```\n  docker run --rm \\\n    --name=trackfs \\\n    --device /dev/fuse \\\n    --cap-add SYS_ADMIN \\\n    --security-opt apparmor:unconfined \\\n    --user $(id -u):$(id -g) \\\n    -v /path/to/yourmusiclibrary:/src:ro \\\n    -v /path/to/yourmountpoint:/dst:rshared \\\n    andresch/trackfs \n  ```\n\n### All `trackfs` options\n\n`trackfs` provides a few options that allow you to tweak its default behavior: \n\n* `-e EXTENSION`, `--extension EXTENSION` (default: \"(\\\\.flac|\\\\.wav)\") : \n  A regular expression matching file extension of album files in the music library \n* `-s SEPARATOR`, `--separator SEPARATOR` (default: \".#-#.\"): \n  The separator used inside the name of the track-files. Must never occur in regular filenames \n* `-i IGNORE`, `--ignore-tags IGNORE` (default: \"CUE_TRACK.*|COMMENT\"):\n  A regular expression matching all tags in the FLAC+CUE file that will not be copied over to the track FLACs \n* `-k`, `--keep-album`: \n  Keep the source album file (FLAC+CUE or WAVE) in the `trackfs` filesystem in addition to the individual tracks\n* `-t TITLE_LENGTH`, `--title-length TITLE_LENGTH` (default: 20):\n  Nr. of characters of the track title in filename of track \n* `--root-allowed`:\n  Allow running `trackfs` as with root permissions; Neither necessary nor recommended. \n  Use only when you know what you are doing\n* `-v`, `--verbose`:\n  Activate info-level logging\n* `-d`, `--debug`:\n  Activate debug-level logging\n\n\nYou can use `-h`, `--help` to get a list of all all options. Keep in mind that the parameters `root` and `mount` are already defined with the two `-v` options to `docker run` and are implicitly set by the docker container.\n\nMeta-Data in in Track Files\n---------------------------\n\nMost tags of the album file will be set in the track files too. There are only two exceptions:\n* Tags that contain multi-line values (like the `CUESHEET`-tag)\n* Any tag whose name matches the regular expression of the `--ignore-tags` option (default: `\"CUE_TRACK.*|COMMENT\"`)\n\nIn addition `trackfs` does the following modifications to tags:\n- If the album file contains an `ARTIST` tag but no `ALBUMARTIST` tag, then an `ALBUMARTIST` tag will be created with the value of `ARTIST` tag.\n- If the album file contains a `TITLE`tag, but no `ALBUM` tag, then an `ALBUM` tag will be created with the value of the `TITLE` tag.\n- If the cue sheet contains a `TITLE` tag for a given track, it overwrites the `TITLE` tag from the album file\n- If the cue sheet contains a `PERFORMER` tag for a given track, it overwrites the `ARTIST` tag from the album file\n- If the cue sheet contains a `SONGWRITER` tag for a given track, it overwrites the `COMPOSER` tag from the album file\n- Any other information from the cue sheet will only be used to add their missing corresponding tags from the audio file, but never to overwrite an existing tag. \n\nCue sheet entries of type `PERFORMER`, `SONGWRITER` will be split at \";\" characters and create multiple tags in the track file.\n\nIn case the album has embedded pictures, the first picture will be available in the track file. Alternatively `trackfs` will scan the directory for a jpg-file with the same basename as the album file or a file named `folder.jpg`\n\nManual Installation\n-------------------\n\nIn case you want/have to run `trackfs` on some linux system without docker you can also install the python package `trackfs` manually. Please refer to the [homepage of the trackfs python package](https://pypi.org/project/trackfs/) for further information. \n\nStatus\n------\n\n`trackfs` is currently in an early stage. While it runs stable on the author's NAS, it has not been tested in other environments, esp. on various Linux distributions with different kernels/FUSE versions. Using the dockerized version should remove some of the difficulties, but given the dependencies on FUSE, some my still remain. \n\nAlso keep in mind that this is the author's first python project, so don't expect that the source code matches professional quality criteria of experienced python coders.\n\n### Future improvements:\n\nThere are a few ideas for additional improvements\n* Find out if there is a way to extract tracks from the FLAC+CUE file without re-encoding the track. This should allow to increase the performance when starting to read a track massively\n* ~~Allow encoding in other audio-formats (esp. mp3). While you can create a FUSE chain, by using mp3fs with the trackfs filesystem as source, the performance of that approach is not very compelling and a unified solution might provide bette results.~~ ([ffmpegfs](https://github.com/nschlia/ffmpegfs/tree/VERSION_2.3) has picked up the idea of cuesheets for splitting and transcoding; currently only in dev branch, but soon on master. No need to reinvent the wheel) \n\nTroubleshooting\n---------------\n\nWhen `trackfs` doesn't get properly terminated, then your system might still have an orphaned mount point. When you then restart `trackfs` this will fail with a corresponding error message.\n\nIn that case you have to first unmount the orphaned mount point by calling:\n\n```\nsudo umount /path/to/yourmountpoint\n```\n   \nIn case the path to your mountpoint contains a symbolic link the above might not work as `umount` expects the _real_ path of the mount point. In that case use\n\n```\nmount -t fuse\n```\n\nto find the path that `umount` expects.\n\nIn case `trackfs` hangs (should not happen, but just in case) you might have to explicitly kill it. For that we use the `docker stop` command (which give the container a chance to currently shutdown before killing it). This requires the container name or container id as parameter.\n\nIf you have defined a container name (e.g. to \"trackfs\") you can just use\n\n```\ndocker stop trackfs\n```\n\notherwise your first have to find the id of the container that runs the andresch/trackfs image:\n\n```\ndocker stop $(docker ps | awk '/andresch\\/trackfs/{print $1}')\n```\n\t\nAcknowledgments\n---------------\n\n`trackfs` began its live as a clone of [FLACCue](https://github.com/acenko/FLACCue). While FLACCue is designed for the usage with the Plex media server, the underlying idea of both projects is the same. Although there is little unmodified code of FLACCue left in `trackfs`, the project would most likely not have been started without the ideas in this groundwork. Kudos go to [acenkos](https://github.com/acenko)!\n\nLicense\n-------\n\n`trackfs` is licensed under the terms of the [GNU Lesser General Public License v3.0](https://github.com/andresch/trackfs/blob/master/LICENSE.md)\n\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}