{
  "user": "appthreat",
  "name": "dep-scan",
  "namespace": "appthreat",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Fully open-source security audit for project dependencies.",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 2516,
  "last_updated": "2022-12-24T10:54:14.564572Z",
  "date_registered": "2020-01-31T14:53:51.594914Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "appthreat",
  "has_starred": false,
  "full_description": "# Introduction\n\n```bash\n  ___            _____ _                    _\n / _ \\          |_   _| |                  | |\n/ /_\\ \\_ __  _ __ | | | |__  _ __ ___  __ _| |_\n|  _  | '_ \\| '_ \\| | | '_ \\| '__/ _ \\/ _` | __|\n| | | | |_) | |_) | | | | | | | |  __/ (_| | |_\n\\_| |_/ .__/| .__/\\_/ |_| |_|_|  \\___|\\__,_|\\__|\n      | |   | |\n      |_|   |_|\n```\n\ndep-scan is a fully open-source security audit tool for project dependencies based on known vulnerabilities, advisories and license limitations. Both local repositories and container images are supported as input. The tool is ideal for CI environments with built-in build breaker logic.\n\n[![Docker Repository on Quay](https://quay.io/repository/appthreat/dep-scan/status \"Docker Repository on Quay\")](https://quay.io/repository/appthreat/dep-scan)\n\nIf you have just come across this repo, probably the best place to start is to checkout the parent project [slscan](https://slscan.io) which include depscan along with a number of other tools.\n\n## Features\n\n- Local repos and container image based scanning [1]\n- Package vulnerability scanning is performed locally and is quite fast. No server is used!\n- Configurable `cache` and `sync` functionality to manage local cache data\n- Pre-installed and integrated with [slscan](https://github.com/ShiftLeftSecurity/sast-scan)\n- Suggest optimal fix version by package group (See suggest mode)\n- Perform deep packages risk audit (See risk audit)\n\nNOTE:\n\n- [1] Only application related packages in container images are included in scanning. OS packages are not included yet.\n\n## Usage\n\ndep-scan is ideal for use during continuous integration (CI) and also as a tool for local development.\n\n### Use with ShiftLeft Scan\n\ndep-scan is integrated with [scan](https://github.com/ShiftLeftSecurity/sast-scan), a free and open-source SAST tool. To enable this feature simply pass `depscan` to the `--type` argument. [Refer](https://slscan.io) to the scan documentation for more information.\n\n```yaml\n---\n--type python,depscan,credscan\n```\n\nThis approach should work for all CI environments supported by scan.\n\n### Scanning projects locally (Python version)\n\n```bash\nsudo npm install -g @appthreat/cdxgen\npip install appthreat-depscan\n```\n\nThis would install two commands called `cdxgen` and `scan`.\n\nYou can invoke the scan command directly with the various options.\n\n```bash\ncd <project to scan>\ndepscan --src $PWD --report_file $PWD/reports/depscan.json\n```\n\nFull list of options are below:\n\n```bash\nusage: depscan [-h] [--no-banner] [--cache] [--sync] [--suggest] [--risk-audit] [--private-ns PRIVATE_NS] [-t PROJECT_TYPE] [--bom BOM] -i SRC_DIR [-o REPORT_FILE]\n              [--no-error]\n  -h, --help            show this help message and exit\n  --no-banner           Do not display banner\n  --cache               Cache vulnerability information in platform specific user_data_dir\n  --sync                Sync to receive the latest vulnerability data. Should have invoked cache first.\n  --suggest             Suggest appropriate fix version for each identified vulnerability.\n  --risk-audit          Perform package risk audit (slow operation). Npm only.\n  --private-ns PRIVATE_NS\n                        Private namespace to use while performing oss risk audit. Private packages should not be available in public registries by default. Comma\n                        separated values accepted.\n  -t PROJECT_TYPE, --type PROJECT_TYPE\n                        Override project type if auto-detection is incorrect\n  --bom BOM             Examine using the given Software Bill-of-Materials (SBoM) file in CycloneDX format. Use cdxgen command to produce one.\n  -i SRC_DIR, --src SRC_DIR\n                        Source directory\n  -o REPORT_FILE, --report_file REPORT_FILE\n                        Report filename with directory\n  --no-error            Continue on error to prevent build from breaking\n```\n\n### Scanning containers locally (Python version)\n\nScan `latest` tag of the container `shiftleft/scan-slim`\n\n```bash\ndepscan --no-error --cache --src shiftleft/scan-slim -o containertests/depscan-scan.json -t docker\n```\n\nInclude `license` to the type to perform license audit.\n\n```bash\ndepscan --no-error --cache --src shiftleft/scan-slim -o containertests/depscan-scan.json -t docker,license\n```\n\nYou can also specify the image using the sha256 digest\n\n```bash\ndepscan --no-error --src redmine@sha256:a5c5f8a64a0d9a436a0a6941bc3fb156be0c89996add834fe33b66ebeed2439e -o containertests/depscan-redmine.json -t docker\n```\n\nYou can also save container images using docker or podman save command and pass the archive to depscan for scanning.\n\n```bash\ndocker save -o /tmp/scanslim.tar shiftleft/scan-slim:latest\n# podman save --format oci-archive -o /tmp/scanslim.tar shiftleft/scan-slim:latest\ndepscan --no-error --src /tmp/scanslim.tar -o reports/depscan-scan.json -t docker\n```\n\nRefer to the docker tests under GitHub action workflow for this repo for more examples.\n\n### Scanning projects locally (Docker container)\n\n`appthreat/dep-scan` or `quay.io/appthreat/dep-scan` container image can be used to perform the scan.\n\nTo scan with default settings\n\n```bash\ndocker run --rm -v $PWD:/app appthreat/dep-scan scan --src /app --report_file /app/reports/depscan.json\n```\n\nTo scan with custom environment variables based configuration\n\n```bash\ndocker run --rm \\\n    -e VDB_HOME=/db \\\n    -e NVD_START_YEAR=2010 \\\n    -e GITHUB_PAGE_COUNT=5 \\\n    -e GITHUB_TOKEN=<token> \\\n    -v /tmp:/db \\\n    -v $PWD:/app appthreat/dep-scan scan --src /app --report_file /app/reports/depscan.json\n```\n\nIn the above example, `/tmp` is mounted as `/db` into the container. This directory is then specified as `VDB_HOME` for caching the vulnerability information. This way the database can be cached and reused to improve performance.\n\n## Supported languages and package format\n\ndep-scan uses [cdxgen](https://github.com/AppThreat/cdxgen) command internally to create Software Bill-of-Materials (SBoM) file for the project. This is then used for performing the scans.\n\nThe following projects and package-dependency format is supported by cdxgen.\n\n| Language           | Package format                                                         |\n| ------------------ | ---------------------------------------------------------------------- |\n| node.js            | package-lock.json, pnpm-lock.yaml, yarn.lock, rush.js                  |\n| java               | maven (pom.xml [1]), gradle (build.gradle, .kts), scala (sbt)          |\n| php                | composer.lock                                                          |\n| python             | setup.py, requirements.txt [2], Pipfile.lock, poetry.lock, bdist_wheel |\n| go                 | go.mod, go.sum, Gopkg.lock                                             |\n| ruby               | Gemfile.lock, gemspec                                                  |\n| rust               | Cargo.toml, Cargo.lock                                                 |\n| .Net Framework     | .csproj, packages.config                                               |\n| .Net core          | .csproj, packages.config                                               |\n| docker / oci image | All supported languages excluding OS packages                          |\n\n**NOTE**\n\nThe docker image for dep-scan currently doesn't bundle suitable java and maven commands required for bom generation. To workaround this limitation, you can -\n\n1. Use python-based execution from a VM containing the correct versions for java, maven and gradle.\n2. Generate the bom file by invoking `cdxgen` command locally and subsequently passing this to `dep-scan` via the `--bom` argument.\n\n## Integration with CI environments\n\n### Integration with Azure DevOps\n\nRefer to [this example yaml](https://github.com/AppThreat/WebGoat/blob/develop/azure-pipelines.yml#L33) configuration for integrating dep-scan with Azure Pipelines. The build step would perform the scan and display the report inline as shown below:\n\n![Azure DevOps integration](docs/dep-scan-azure.png)\n\n### Integration with GitHub Actions\n\nThis tool can be used with GitHub Actions using this [action](https://github.com/marketplace/actions/dep-scan).\n\nThis repo self-tests itself with both sast-scan and dep-scan! Check the GitHub [workflow file](https://github.com/AppThreat/dep-scan/blob/master/.github/workflows/pythonapp.yml) of this repo.\n\n```yaml\n- name: Self dep-scan\n  uses: AppThreat/dep-scan-action@master\n  env:\n    VDB_HOME: ${{ github.workspace }}/db\n    GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}\n```\n\n## Customisation through environment variables\n\nThe following environment variables can be used to customise the behaviour.\n\n- VDB_HOME - Directory to use for caching database. For docker based execution, this directory should get mounted as a volume from the host\n- NVD_START_YEAR - Default: 2018. Supports upto 2002\n- GITHUB_PAGE_COUNT - Default: 2. Supports upto 20\n\n## GitHub Security Advisory\n\nTo download security advisories from GitHub, a personal access token with the following scope is necessary.\n\n- read:packages\n\n```bash\nexport GITHUB_TOKEN=\"<PAT token>\"\n```\n\n## Suggest mode\n\nFix version for each vulnerability is retrieved from the sources. Sometimes, there might be known vulnerabilities in the fix version reported. Eg: in the below screenshot the fix versions suggested for jackson-databind might contain known vulnerabilities.\n\n![Normal mode](docs/depscan-normal.png)\n\nBy passing an argument `--suggest` it is possible to force depscan to recheck the fix suggestions. This way the suggestion becomes more optimal for a given package group.\n\n![Suggest mode](docs/depscan-suggest.png)\n\nNotice, how the new suggested version is `2.9.10.5` which is an optimal fix version. Please note that the optimal fix version may not be the appropriate version for your application based on compatibility.\n\n## Package Risk audit\n\n`--risk-audit` argument enables package risk audit. Currently, only npm and pypi packages are supported in this mode. A number of risk factors are identified and assigned weights to compute a final risk score. Packages that then exceed a maximum risk score (`config.pkg_max_risk_score`) are presented in a table.\n\nUse `--private-ns` to specify the private package namespace that should be checked for dependency confusion type issues where a private package is available on public npm/pypi registry.\n\nExample to check if private packages with namespaces @appthreat and @shiftleft are not accidentally made public use the below argument.\n\n```\n--private-ns appthreat,shiftleft\n```\n\n| Risk category                  | Default Weight | Reason                                                                                                                                                                                                     |\n| ------------------------------ | -------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| pkg_private_on_public_registry | 4              | Private package is available on a public registry                                                                                                                                                          |\n| pkg_min_versions               | 2              | Packages with less than 3 versions represent an extreme where they could be either super stable or quite recent. Special heuristics are applied to ignore older stable packages                            |\n| mod_create_min_seconds         | 1              | Less than 12 hours difference between modified and creation time. This indicates that the upload had a defect that had to be rectified immediately. Sometimes, such a rapid update could also be malicious |\n| latest_now_min_seconds         | 0.5            | Less than 12 hours difference between the latest version and the current time. Depending on the package such a latest version may or may not be desirable                                                  |\n| latest_now_max_seconds         | 0.5            | Package versions that are over 6 years old are in use. Such packages might have vulnerable dependencies that are known or yet to be found                                                                  |\n| pkg_min_maintainers            | 2              | Package has less than 2 maintainers. Many opensource projects have only 1 or 2 maintainers so special heuristics are used to ignore older stable packages                                                  |\n| pkg_min_users                  | 0.25           | Package has less than 2 npm users                                                                                                                                                                          |\n| pkg_install_scripts            | 2              | Package runs a custom pre or post installation scripts. This is often malicious and a downside of npm.                                                                                                     |\n| pkg_node_version               | 0.5            | Package supports outdated version of node such as 0.8, 0.10, 4 or 6.x. Such projects might have prototype pollution or closure related vulnerabilities                                                     |\n| pkg_scope                      | 4 or 0.5       | Packages that are used directly in the application (required scope) gets a score with a weight of 4. Optional packages get a score of 0.25                                                                 |\n| deprecated                     | 1              | Latest version is deprecated                                                                                                                                                                               |\n\nRefer to `pkg_query.py::get_category_score` method for the risk formula.\n\n### Automatic adjustment\n\nA parameter called `created_now_quarantine_seconds` is used to identify packages that are safely past the quarantine period (1 year). Certain risks such as `pkg_min_versions` and `pkg_min_maintainers` are suppressed for packages past the quarantine period. This adjustment helps reduce noise since it is unlikely that a malicious package can exist in a registry unnoticed for over a year.\n\n### Configuring weights\n\nAll parameters can be customized by using environment variables. For eg:\n\nexport PKG_MIN_VERSIONS=4 to increase and set the minimum versions category to 4.\n\n## License scan\n\ndep-scan can scan the dependencies for any license limitations and report them directly on the console log. To enable license scanning set the environment variable `FETCH_LICENSE` to `true`.\n\n```\nexport FETCH_LICENSE=true\n```\n\nThe licenses data is sourced from choosealicense.com and is quite limited. If the license of a given package cannot be reliably matched against this list it will get silently ignored to reduce any noise. This behaviour could change in the future once the detection logic gets improved.\n\n![License scan](docs/license-scan.png)\n\n## Alternatives\n\n[Dependency Check](https://github.com/jeremylong/DependencyCheck) is considered to be the industry standard for open-source dependency scanning. After personally using this great product for a number of years I decided to write my own from scratch partly as a dedication to this project. By using a streaming database based on msgpack and using json schema, dep-scan is more performant than dependency check in CI environments. Plus with support for GitHub advisory source and grafeas report export and submission, dep-scan is on track to become a next-generation dependency audit tool\n\nThere are a number of other tools that piggy back on Sonatype [ossindex](https://ossindex.sonatype.org/) API server. For some reason, I always felt uncomfortable letting a commercial company track the usage of various projects across the world. dep-scan is therefore 100% private and guarantees never to perform any tracking!\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}