{
  "user": "bndes",
  "name": "bndestoken",
  "namespace": "bndes",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Token para representar as liberações do BNDES e prover mais transparência de recursos públicos.",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 180,
  "last_updated": "2019-06-12T14:45:03.589365Z",
  "date_registered": "2019-03-12T15:16:50.802202Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "bndes",
  "has_starred": false,
  "full_description": "# BNDES TOKEN\n\nToken para representar as liberações do BNDES de forma a prover mais transparência de recursos públicos. <br>\nDo you want to know how to install or execute bndestoken? See Instalation-Execution-Guide.md\n\n\n# ATORES\n\n1.\tBNDES: Empregado(s) do BNDES responsável(is) por (i) analisar os cadastros de clientes e fornecedores, (ii) realizar as liberações de crédito e (iii) efetivar os resgates.\n\n2.\tCliente: Cliente contratado do BNDES, que obteve um financiamento ou apoio não reembolsável para o desenvolvimento e/ou implantação de um projeto.\n\n3.\tFornecedor: Entidade pessoa jurídica que fornece produtos ou serviços ao Cliente, e por ele é remunerada para o desenvolvimento e/ou implantação de projeto que foi objeto de financiamento ou apoio não reembolsável.\n\n4.\tSociedade: Qualquer cidadão que deseje acompanhar as liberações, transferências e resgates relacionados a financiamentos e/ou apoios não reembolsáveis feitos pelo BNDES.\n\n\n# FUNCIONALIDADES\n\n1.\tBNDES:\n\na.\tLiberar – Permite que o BNDES libere recursos para um cliente de um financiamento ou apoio não reembolsável. São pré-requisitos que o financiamento ou apoio já tenham sido contratados junto ao BNDES e que o Cliente tenha realizado o cadastro da sua conta Blockchain.\n\nb.\tValidar Cadastro – Permite que o BNDES valide o cadastro da conta Blockchain de um Cliente ou Fornecedor após a checagem dos dados cadastrados na aplicação e dos documentos enviados.\n\nc.\tLiquidar Resgates – Permite que o BNDES liquide os resgastes solicitados pelo Fornecedor, ou seja, que os BNDESTokens detidos pelo Fornecedor sejam devolvidos ao BNDES e queimados na sequência, mediante a transferência do valor correspondente em dinheiro fiduciário para a conta corrente do Fornecedor.\n\n2.\tCliente:\n\na.\tAssociar Conta – Permite que o Cliente associe a sua conta Blockchain ao seu CNPJ e subcrédito, mediante o envio de uma declaração assinada com o seu e-CNPJ.\n\nb.\tTransferir – Permite que o Cliente transfira BNDESTokens para um Repassador ou para um Fornecedor, mediante o registro da justificativa para transferência e a associação opcional de um documento de suporte à transação, como o link de uma nota fiscal eletrônica ou um recibo digitalizado.\n\nc.\tConsultar Transferências – Permite que o Ciente visualize as transferências de BNDESTokens realizadas.\n\nd.\tTrocar Conta – Permite que o Cliente troque a conta Blockchain associada a um subcrédito, mediante o envio de nova declaração assinada com o seu e-CNPJ. O Cliente pode precisar trocar a conta devido à perda ou ao roubo da chave privada.\n\n3.\tFornecedor:\n\na.\tAssociar Conta - Permite que o Fornecedor associe a sua conta Blockchain e a sua conta corrente ao seu CNPJ, mediante o envio de uma declaração assinada com o seu e-CNPJ.\n\nb.\tSolicitar Resgate – Permite que o fornecedor solicite o resgate de BNDESTokens que estão sob sua posse junto ao BNDES.\n\nc.\tTrocar Conta – Permite que o Fornecedor troque a conta Blockchain associada a um subcrédito. O Fornecedor pode precisar trocar a conta devido à perda ou ao roubo da chave privada.\n\n4.\tSociedade:\n\na.\tDashboard Cadastro – Permite que a Sociedade acesse as informações das transações de cadastro de contas Blockchain de Clientes, Repassadores e Fornecedores.\n\nb.\tDashboard Transações – Permite que a Sociedade acesse as informações das transações de liberação, transferência, solicitações de resgate e liquidações de resgate entre o BNDES, Clientes, Repassadores e Fornecedores.\n\n\n# COMPONENTES\n\n1.\tFront: interface visual da aplicação, com telas para acessar as funcionalidades descritas abaixo. O front está escrito em Angular 4.\n\n2.\tBack: camada da aplicação responsável pela integração com os sistemas legados escrita em NodeJS. Hoje, os sistemas legados estão mockados numa base Mongo.\n\n3.\tBack-Blockchain: camada da aplicação que é executada on-chain. Os smarts contracts fazem parte dessa camada e são escritos em Solidity.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}