{
  "user": "borchero",
  "name": "pyblaze",
  "namespace": "borchero",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 290,
  "last_updated": "2020-12-29T22:52:35.558877Z",
  "date_registered": "2020-03-27T16:39:07.239746Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "borchero",
  "has_starred": false,
  "full_description": "# PyBlaze\n\n![PyPi](https://img.shields.io/pypi/v/pyblaze?label=version)\n\nPyBlaze is a high-level library for large-scale machine learning in [PyTorch](https://pytorch.org). It is engineered to cut obsolete boilerplate code while preserving the flexibility of PyTorch to create just about any deep learning model.\n\n## Features\n\nGenerally, PyBlaze provides an object-oriented approach to extend PyTorch's API. The core design objective is to provide an API both as simple and as extensible as possible. PyBlaze's features include the following:\n\n* Training and prediction loops with minimal code required and callback support.\n* Out-of-the-box multi-GPU support where not a single additional line of code is required.\n* Intuitive multiprocessing by providing easy for-loop vectorization.\n* Modules and functions missing in PyTorch.\n\nCurrently, PyBlaze only provides means for running training/inference on a single machine. In case this is insufficient, you might be better off using PyTorch's `distributed` package directly.\n\nIt must be emphasized that PyBlaze is not meant to be a wrapper for PyTorch as Keras is for TensorFlow - it only provides *extensions*.\n\n## Installation\n\nPyBlaze is available on PyPi and can simply be installed as follows:\n\n```bash\npip install pyblaze\n```\n\n## Quickstart\n\nAn introduction to PyBlaze is given as a tutorial training an image classifier. It can be found in the documentation's [guide section](https://pyblaze.borchero.com/guides/supervised.html).\n\n## License\n\nPyBlaze is licensed under the [MIT License](LICENSE).\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}