{
  "user": "browserless",
  "name": "chrome",
  "namespace": "browserless",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Chrome as a service container. Bring your own hardware or cloud.",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 176,
  "pull_count": 137566565,
  "last_updated": "2023-01-04T15:10:47.978822Z",
  "date_registered": "2017-11-17T05:09:34.067435Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "browserless",
  "has_starred": false,
  "full_description": "<div align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/browserless/chrome/master/assets/browserless_logo_screen_gradient.png\">\n</div>\n\n[![Build Status](https://travis-ci.org/browserless/chrome.svg?branch=master)](https://travis-ci.org/browserless/chrome)\n![Dependabot](https://flat.badgen.net/badge/-/dependabot?icon=dependabot&label&color=green)\n\nbrowserless is a web-service that allows for remote clients to connect, drive, and execute headless work; all inside of docker. It offers first-class integrations for puppeteer, playwright, selenium's webdriver, and a slew of handy REST APIs for doing more common work. On top of all that it takes care of other common issues such as missing system-fonts, missing external libraries, and performance improvements. We even handle edge-cases like downloading files, managing sessions, and have a fully-fledged documentation site.\n\nIf you've been struggling to get Chrome up and running docker, or scaling out your headless workloads, then browserless was built for you.\n# Table of Contents\n\n1. [Features](#features)\n2. [How it works](#how-it-works)\n3. [Docker](#docker)\n4. [Using the debuggers](#live-debugger)\n5. [Recommended NGINX Config](#Recommended-NGINX-Config)\n6. [Hosting](#hosting-providers)\n7. [Using with puppeteer](#puppeteer)\n8. [Using with selenium](#webdriver)\n9. [Using with playwright](#playwright)\n10. [Licensing](#licensing)\n12. [Changelog](https://github.com/browserless/chrome/blob/master/CHANGELOG.md)\n\n## External links\n\n1. [Full documentation site](https://docs.browserless.io/)\n2. [Live Debugger (using browserless.io)](https://chrome.browserless.io/)\n3. [Docker](https://hub.docker.com/r/browserless/chrome/)\n4. [Slack](https://join.slack.com/t/browserless/shared_invite/enQtMzA3OTMwNjA3MzY1LTRmMWU5NjQ0MTQ2YTE2YmU3MzdjNmVlMmU4MThjM2UxODNmNzNlZjVkY2U2NjdkMzYyNTgyZTBiMmE3Nzg0MzY)\n\n# Features\n\n- Parallelism and queueing are built-in and configurable.\n- Fonts and emoji's working out-of-the-box.\n- Debug Viewer for actively viewing/debugging running sessions.\n- Docker releases that are built for specific puppeteer versions.\n- Docker image's are labelled with information on the version of Chrome, V8, webkit and more.\n- An interactive puppeteer debugger, so you can see what the headless browser is doing and use its DevTools.\n- Works with most headless libraries.\n- Configurable session timers and health-checks to keep things running smoothly.\n- Error tolerant: if Chrome dies it won't.\n- [Support for running and development on Apple's M1 machines](#building-for-arm64-apple-m1-machines)\n\n# How it works\n\nbrowserless listens for both incoming websocket requests, generally issued by most libraries, as well as pre-build REST APIs to do common functions (PDF generation, images and so on). When a websocket connects to browserless it invokes Chrome and proxies your request into it. Once the session is done then it closes and awaits for more connections. Some libraries use Chrome's HTTP endpoints, like `/json` to inspect debug-able targets, which browserless also supports.\n\nYour application still runs the script itself (much like a database interaction), which gives you total control over what library you want to choose and when to do upgrades. This is preferable over other solutions as Chrome is still breaking their debugging protocol quite frequently.\n\n# Docker\n\n> See more options on our [full documentation site](https://docs.browserless.io/docs/docker.html).\n\n1. `docker run -p 3000:3000 browserless/chrome`\n2. Visit `http://localhost:3000/` to use the interactive debugger.\n3. See more at our [docker repository](https://hub.docker.com/r/browserless/chrome/).\n\n# Live Debugger\n\n![Browserless Debugger](https://raw.githubusercontent.com/browserless/chrome/master/assets/demo.gif)\n\nbrowserless comes with _two_ methods of debugging. The first is a web-based debugger for trying out small chunks of code without setting up a new project. You can see our public-facing [debugger here](https://chrome.browserless.io/).\n\nThe second method is an active-session debugger. When browserless runs http requests, and puppeteer sessions, it keeps track of some browser state, and makes those sessions available for debugging. You can simply load the web-based debugger in the browser, and click the menu icon in the top-left. It'll reveal all currently running sessions and a link to \"view\" them in Chrome's remote devtools. You can also query the `/session` API to get a JSON representation of sessions as well.\n\nIf you're using the active-session debugger, and it's executing too fast, you can apply a `?pause` query parameter to your `puppeteer.connect` call (or HTTP REST calls) and browserless will pause your script until the debugger connects. This way you don't miss any critical actions!\n\nbrowserless ships with an interactive debugger that makes writing scripts faster and interactive. You can use things like `debugger;` and `console.log` to capture what's happening on the page while your script is running. All of the Chrome devtools are there at your disposal. A small list of features includes:\n\n- Using debugging concepts like `debugger;` and `console.log`\n- Errors in the script are caught and show up in the `console` tab\n- You can inspect the DOM, watch network requests, and even see how the page is rendering\n- Coming soon you'll be able to export the script which will produce a `index.js` and a `package.json` to get things going\n\n# Recommended NGINX Config\n\nIf you're using nginx in front of the docker image (or Node) then you'll need to proxy through Upgrade headers. Below is an example of a location block that does such:\n\n```\nlocation / {\n    proxy_pass YOUR_DOCKER_IMAGE_LOCATION;\n    proxy_http_version 1.1;\n    proxy_set_header Upgrade $http_upgrade;\n    proxy_set_header Connection 'upgrade';\n    proxy_set_header Host $host;\n    proxy_cache_bypass $http_upgrade;\n  }\n```\n\n# Building for ARM64 (Apple M1 Machines)\n\n**TL;DR**\nYou can simply pull our M1 specific builds:\n\n```sh\ndocker pull browserless/chrome:1-arm64\n```\n\nFist, if you're on a amd64 machine (non-M1 Mac) you'll need to setup multi-platform builds. There's a lot of good resources out there to read about this, however you'll need to ensure you're on the latest docker with experimental features enabled.\n\n```sh\n# Setup the machine to build arm64\ndocker run --rm --privileged multiarch/qemu-user-static --reset -p yes\n\n# Create a builder to handle arm64 builds\ndocker buildx create --name builder --driver docker-container --use\n\n# Setup the builder to get started\ndocker buildx inspect --bootstrap\n```\n\nOnce complete, you can specify a platform target and build against it. In our production tags, we build a special `1-arm64` tag, which is what we'll use in the example below.\n\n```sh\ndocker buildx build --platform linux/arm64 -t browserless/chrome:arm64 .\n```\n\nIn order to support arm64 inside of docker, we utilize some functionality inside of playwright to download an arm64 linux build. Since most distributions out there don't have an arm64-specific build Chromium, this means that puppeteer's chromium doesn't exist for arm64 (as far as we're aware). This, in short, means that the chromium version inside of the arm builds isn't matched _exactly_ for the version of puppeteer that it comes bundled with. Most of the time this will go unnoticed, however if you have an issue it's possible that it's because the version of chromium in the arm64-builds isn't an exact match.\n\n# Hosting Providers\n\nWe offer a first-class hosted product located [here](https://browserless.io). Alternatively you can host this image on just about any major platform that offers hosting for docker. The hosted service takes care of all the machine provisioning, notifications, dashboards and monitoring plus more:\n\n- Easily upgrade and toggle between versions at the press of a button. No managing repositories and other code artifacts.\n- Never need to update or pull anything from docker. There's literally zero software to install to get started.\n- Scale your consumption up or down with different plans. We support up to thousands of concurrent sessions at a given time.\n\nIf you're interested in using this image for commercial aspects, then please read the below section on licensing.\n\n# Puppeteer\n\nPuppeteer allows you to specify a remote location for chrome via the `browserWSEndpoint` option. Setting this for browserless is a single line of code change.\n\n**Before**\n```js\nconst browser = await puppeteer.launch();\n```\n\n**After**\n```js\nconst browser = await puppeteer.connect({ browserWSEndpoint: 'ws://localhost:3000' });\n```\n\n# Webdriver (selenium)\n\nGetting started with Selenium and webdriver couldn't be easier. Once browserless is up and running simply update your application or test to use it as a remote connection:\n\n**Before**\n```js\nconst webdriver = require('selenium-webdriver');\nconst fs = require('fs');\n\nconst chromeCapabilities = webdriver.Capabilities.chrome();\nchromeCapabilities.set(\n  'chromeOptions', {\n    args: [\n      '--headless',\n      '--no-sandbox',\n    ],\n  }\n);\n\nconst driver = new webdriver.Builder()\n  .forBrowser('chrome')\n  .withCapabilities(chromeCapabilities)\n  .build();\n```\n\n**After**\n```js\nconst webdriver = require('selenium-webdriver');\nconst fs = require('fs');\n\nconst chromeCapabilities = webdriver.Capabilities.chrome();\nchromeCapabilities.set(\n  'chromeOptions', {\n    args: [\n      '--headless',\n      '--no-sandbox',\n    ],\n  }\n);\n\nconst driver = new webdriver.Builder()\n  .forBrowser('chrome')\n  .withCapabilities(chromeCapabilities)\n  .usingServer('http://localhost:3000/webdriver') // <-- Apply usingServer and that's it\n  .build();\n```\n\n# Playwright\n\nWe support running with playwright via their remote connection method on the `chromium` interface. Since playwright is very similar to puppeteer, even launch arguments and other things \"just work\":\n\n**Before**\n```js\nconst browser = await pw.chromium.launch();\n```\n\n**After**\n```js\nconst browser = await pw.chromium.connect({\n  browserWSEndpoint: 'wss://chrome.browserless.io?token=YOUR-API-TOKEN',\n});\n```\n\nAfter that, the rest of your code remains the same with no other changes required.\n\n# Usage with other libraries\n\nMost libraries allow you to specify a remote instance of Chrome to interact with. They are either looking for a websocket endpoint, a host and port, or some address. Browserless supports these by default, however if you're having issues please make an issue in this project and we'll try and work with the library authors to get them integrated with browserless.\n\nYou can find a much larger list of supported libraries [on our documentation site](https://docs.browserless.io/docs/puppeteer-library.html).\n\n# Motivations\n\nRunning Chrome on lambda is a fantastic idea but in practice is quite challenging. You're met with pretty tough upload limits, building Chrome yourself, and then dealing with odd invocation issues should everything else go ok. A lot of issues in various repositories are due to just challenges of getting Chrome running smoothly in AWS (see [here](https://github.com/GoogleChrome/puppeteer/issues?q=is%3Aissue+is%3Aopen+sort%3Acomments-desc)). You can see for yourself by going to nearly any library and sorting issues by most commented.\n\nGetting Chrome running well in docker is also a challenge as there's quiet a few packages you need in order to get Chrome running. Once that's done then there's still missing fonts, getting libraries to work with it, and having limitations on service reliability.\n\nAll of these issues prompted me to build a first-class image and workflow for interacting with Chrome in a more streamlined way. With browserless you never have to worry about fonts, extra packages, library support, or anything else. It should just work. On top of that it comes with a prescribed approach on how you interact with Chrome, which is through socket connections (similar to a database or any other external appliance). What this means is that you get the ability to drive Chrome remotely without having to do updates/releases to the thing that runs Chrome since it's divorced from your application.\n\n# Licensing\n\nIf you want to use browserless to build commercial sites, applications, or in a continuous-integration system that's closed-source then you'll need to purchase a commercial license. This allows you to keep your software proprietary whilst still using browserless. [You can purchase a commercial license here](https://www.browserless.io/sign-up?type=commercial). A commercial license grants you:\n\n- Priority support on issues and features.\n- On-premise running as well as running on public cloud providers for commercial/CI purposes for proprietary systems.\n- Ability to modify the source (forking) for your own purposes.\n\nNot only does it grant you a license to run such a critical piece of infrastructure, but you are also supporting further innovation in this space and our ability to contribute to it!\n\nIf you are creating an open source application under a license compatible with the GNU GPL license v3, you may use browserless under the terms of the GPLv3. You can read more about this license [here](https://www.gnu.org/licenses/quick-guide-gplv3.en.html).\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.distribution.manifest.list.v2+json",
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}