{
  "user": "brujoand",
  "name": "sbp",
  "namespace": "brujoand",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "The Simple Bash Prompt",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 43,
  "last_updated": "2020-08-08T12:56:29.312388Z",
  "date_registered": "2020-07-07T07:49:42.914921Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "brujoand",
  "has_starred": false,
  "full_description": "# SBP - Simple Bash Prompt\n[![Build Status](https://travis-ci.org/brujoand/sbp.svg?branch=master)](https://travis-ci.org/brujoand/sbp)\n\nSimple Bash Prompt (SBP) is a bash prompt, which was simple once.\nThis started out as a pure ripoff from powerline-shell, which is great, but written in python.\nSBP is all bash, which makes it fast and fun.\n\nI've tried making the code as readable and extensible as possible.\nIf something seems wrong, lacking or bad in some way; feel free to rant, review and create a pull request.\n\n![Screenshot](/resources/sbp_screenshot.png)\n\nFor a live demo of this magic [head over\nhere](https://asciinema.org/a/JuTQxC1wfoUr269Tzw8SMejVl)\n\n## A note on the recent changes\nI wanted to add support for truecolors instead of relying on \"just\" 256 colors.\nTo do this I had to break the configuration, and when the flood gates had been\nopened, a lot of things started changing. Suddenly layout changes was pretty\neasy too. After a while speed became and issue, and I had to reduce the number\nof subshells. This led to return by reference which is now the standard way of\nreturning results in the code base. So if you're upgrading from an older version\nit's probably a good idea to make a copy of your sbp config and start fresh.\n\n## Hard Requirements\n  - Bash 4.3+\n\n## Soft Requirements\nIf you want the fancy pointy segment separators, you need the powerline fonts _installed_ and _enabled_. Both.\nYou can get them [here](https://github.com/powerline/fonts) which also has\ninstallation instructions\nNow the hard_to_remember part. Change the settings of your terminal emulator.\nSomething like \"Settings\" and then \"Fonts\" will probably be the right place.\nIf you don't like powerline then use the 'plain' or 'lines' theme or create your\nown. If you are using Kitty as a terminal then everything should work out of the\nbox.\n\n## Installing\n\n### With brew:\n`brew install brujoand/sbp/sbp`\nThis will get you the latest release.\n\n### With git and the install script\nWhen you clone this repo, there is an install script located at ´bin/install´.\nIt will add two lines to `$HOME/.bashrc`:\n```\n  SBP_PATH=/the/path/to/sbp\n  source ${SBP_PATH}/sbp.bash\n```\nYou could also just add these two lines to some bash config file of your own\nchoosing manually. Keep in mind that this approach will use the master branch\nby default, so expect less stability.\n\n## Usage\nSo you're ready to go. Now you do nothing. Just use it. But you could. If you want. Change stuff up a bit.\nEdit your config by running `sbp edit config` and run `sbp reload` if you changed\nsomething substantial. Most changes will be effective immediately.\nYou can use the `sbp` command for a lot of things:\n```\n  Usage: sbp [command]\n\n  Commands:\n  reload            - Reload SBP and user settings\n  status            - Show the current configuration\n  help              - Show this help text\n  list\n    config          - List all current settings\n    segments        - List all available segments\n    hooks           - List all available hooks\n    themes          - List all available color themes and layouts\n  edit\n    config          - Opens the sbp config in $EDITOR\n    colors          - Opens the colors config in $EDITOR\n  set\n    color           - Set [color] for the current session\n    layout          - Set [layout] for the current session\n  toggle\n    peekaboo        - Toggle execution of [segment] or [hook]\n    debug           - Toggle debug mode\n  sbp\n```\n\n## Features\n### Segments\nSegments can be configured, moved, and hidden depending on your mood, or\nenvironment. Read more about those and how to make your own in the [Segments\nFolder](/src/segments).\n\n### Hooks\nHooks let's you execute scripts asynchronously to either alert you, or prepare\ndata in some way. Whatever you want really. Read more about those and how to\nmake your own in the [Hooks Folder](/src/hooks).\n\n### Colors and Layouts\nColors and layouts let you decide how the prompt is drawn. Read more about those\nand how to make your own in the [Colors](/src/colors) and\n[Layouts](/src/layouts). SBP supports both truecolors through RGB values and 256 colors\nby using ansi codes. Many will probably just want to rely on the configuration\nset in Xresources, by using the xresources color setting.\n\n#### Beta - VI mode\n~~The setting `settings_prompt_ready_vi_mode=1` will use the `prompt_ready` icon\nwith the configured colors and change it's color depending on the current VI\nmode if enabled. The cursor will also change from blinking to solid block if\nyour terminal supports it.~~\nThe VI mode support has been removed as it is not possible to predictably place\nthe VI mode indicator on a multiline prompt. PR's are very welcome if you find a\nway to do this.\n\n### FAQ\n\n#### Is this really just bash?\nYes, but actually no. At the time of writing the main implementation has\njust a few calls do date, while some segments touch grep and sed but these\nare being removed. Sometimes we need to talk to other CLI applications though like\ngit.\n\n#### My prompt doesn't show any colors, whats wrong?\nYou are using a terminal that doesn't support truecolors, the OSX Terminal.app maybe?\nYou can write your own ansi theme, or use one of the two provided ones, default-256 or xresources.\n\n#### I don't want to install any fancy fonts, can I still have nice things?\nWhy yes! Simply use the 'plain' layout. No fonts needed. Or use the\n[Kitty](https://sw.kovidgoyal.net/kitty/) terminal which will draw most of the\nmissing characters for you.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}