{
  "user": "chiefwigms",
  "name": "picobrew_pico",
  "namespace": "chiefwigms",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Allows for standalone full control of the PicoBrew suite of devices",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 3,
  "pull_count": 98046,
  "last_updated": "2022-05-24T15:37:18.314667Z",
  "date_registered": "2020-06-13T22:57:39.454921Z",
  "collaborator_count": 1,
  "affiliation": null,
  "hub_user": "chiefwigms",
  "has_starred": false,
  "full_description": "# picobrew_pico\nAllows for full control of the PicoBrew Pico S/C/Pro & Zymatic models.  Shout out to [@hotzenklotz](https://github.com/hotzenklotz/picobrew-server), Brian Moineau for PicoFerm API, @tmack8001 for Z series support & updates.  \n[Demo Server](http://ec2-3-136-112-93.us-east-2.compute.amazonaws.com/)\n\n## Supported Devices:\n* Pico S/C/Pro: fully featured\n* Zymatic: fully featured\n* ZSeries: fully featured\n* PicoFerm (Beta - Currently terminates fermentation after 14 days)\n* PicoStill (Beta)\n  * Firmware versions 0.0.30 - 0.0.35 (selectable)\n  * Pico S/C/Pro distillation (no session logging - limitation of firmware)\n  * ZSeries (full session logging as included in Z firmware)\n* iSpindel (Beta)\n* Tilt (Beta)\n\n## Features\n* Device Aliasing\n* Brew Sessions\n  * Live Graphing\n  * Historical Graphing\n* Recipe Library\n  * View Previously Created\n  * Create New Recipes\n  * Import from PicoBrew Servers (Pico C/S/Pro and Zymatic)\n* Manual Recipe Editing\n  * **Note** The table for adding/removing/editing recipe steps has several validation checks in it, but there is always the possiblity of ruining your Pico.  \n  * *For Pico S/C/Pro Only*: DO NOT EDIT or MOVE Rows 1-3 (Preparing to Brew/Heating/Dough In).  Drain times should all be 0 except for Mash Out (2 minutes) and the last hop addition (5 minutes) (for example, if you only have Hops 1 & 2, set the drain time on Hops 2 to 5, and remove the Hops 3 and 4 rows)\n\n## Installation\n\nRefer to the [Releases Page](https://github.com/chiefwigms/picobrew_pico/releases) for steps to get up and running with your own Pico server with a Raspberry Pi device (recommended models include: Raspberry Pi Zero-W or Raspberry Pi 4).\n\nBy default the hostname of the RaspberryPi device will be \"raspberrypi\" and is discoverable on your local network along with the \"samba\" (or network shares) for sessions and recipes. You can use these to view the files created by the server during interactions with the user and connected devices.\n\n### Debugging Issues\n\nThere are two primary ways to help get additional details of errors that occur.\n\nFirst is to see what is happening in your local browser. Most modern browsers have \"development tools\" that are included (in Chrome \"Settings > More Tools > Developer Tools\") and from these there are usually a console log as well as a \"Network\" tab that shows all the network requests made by the existing experience/page.\n\nSecond is to view the application logs from the included python server over an ssh or local keyboard+screen session.\n\n```\nsudo systemctl status rc.local -n <num-log-lines>\n```\n\nThe remainder of this guide is oriented around creating a development environment for contributors.\n\n# Development Setup\n\n## Requirements\n\nDNS Forwarding (either through a router, RaspberryPi etc)  \n  - Have a Raspberry Pi Zero W : https://albeec13.github.io/2017/09/26/raspberry-pi-zero-w-simultaneous-ap-and-managed-mode-wifi/\n  - DD-WRT/Open-WRT etc : Add additional option added to dnsmasq.conf: `address=/picobrew.com/<Server IP running this code>`\n\n### Option 1: Running pre packaged server via Docker or Docker-Compose\nDocker v19.x (https://docs.docker.com/get-docker/)\n\n#### Setup/Run\n\nSetup the following directory structure for use by the server.\n```\nrecipes/\n  pico/\n  zymatic/\nsessions/\n  brew/\n    active/\n    archive/\n  ferm/\n    active/\n    archive/\n```\n\nRun server volume mounting the above directory structure.\n\n##### (Optional) Step 1: Generate SSL Certs\n\nIf you are looking to support a ZSeries device which requires HTTP+SSL communication we need to generatae some self-signed certificates to place in front of the flask app. These will be used when running nginx to terminate SSL connection before sending the requests for processing by flask.\n\n```\n./scripts/doccker/nginx/ssl_certificates.sh\n```\n\nOn MacOS you can add permenant trust for the Certificate Authority (yourself) if you use Chrome and/or Safari this makes it so that the authority of the certificate generaated above is trusted. Only these browsers check keychain access to get a list of CAs whereas Firefox stores its own list of trusted CAs in the browser.\n\n```\nsudo security add-trusted-cert -d -r trustAsRoot -k /Library/Keychains/System.keychain $(pwd)/scripts/docker/nginx/certs/bundle.crt\n```\n\n##### Step 2: Run Flask Server (optionally with `docker run` or with `docker-compose`)\n\nEither provide all variables to docker command directly or use the repository's docker-compose.yml (which will also include a working SSL enabled nginx configuration given you have setup certificates correctly with `./scripts/docker/nginx/ssl_certificates.sh`)\n\n###### Option 1: Docker Run (without SSL support or external SSL termination)\n\nRunning straight with docker is useful for easy setups which don't require SSL connections (aka non ZSeries brew setups) and/or for those that leveraging another existing system to handle the SSL connections (ie. mitmproxy, nginx, etc).\n\n```\ndocker run -d -it -p 80:80 --name picobrew_pico \\\n  --mount type=bind,source=<absolute-path-to-recipes>,target=/picobrew_pico/app/recipes \\\n  --mount type=bind,source=<absolute-path-to-sessions>,target=/picobrew_pico/app/sessions \\\n  chiefwigms/picobrew_pico\n```\n\nTo view logs check the running docker containers and tail the specific instance's logs directly via docker.\n\n```\ndocker ps\nCONTAINER ID        IMAGE                     COMMAND                  CREATED             STATUS              PORTS                NAMES\n3cfda85cd90c        chiefwigms/picobrew_pico   \"/bin/sh -c 'python3…\"   45 seconds ago      Up 45 seconds       0.0.0.0:80->80/tcp   picobrew_pico\n```\n\n```\ndocker logs -f 3cfda85cd90c\nWebSocket transport not available. Install eventlet or gevent and gevent-websocket for improved performance.\n * Serving Flask app \"app\" (lazy loading)\n * Environment: production\n   WARNING: This is a development server. Do not use it in a production deployment.\n   Use a production WSGI server instead.\n * Debug mode: off\n * Running on http://0.0.0.0:80/ (Press CTRL+C to quit)\n```\n\n###### Option 2: Docker Compose (with SSL support via a dedicated nginx container)\n\nTo run a setup with http and https and want to have the ssl termination handled by the included nginx `docker-compose` is the easiest configuration to go with.\n\n```\ndocker-compose up --build\n```\n\nor to start the servers in the background\n\n```\ndocker-compose up --build -d\n```\n\nTo view logs use the aliases service name `app` to view logs via the docker-compose command.\n\n```\ndocker-compose logs -f app\n```\n\n### Option 2: Running server via Python directly (optionally terminating ssl elsewhere manually)\nPython >= 3.6.9  \n\n#### Setup/Run\nClone this repo, then run  \n`sudo pip3 install -r requirements.txt` on *nix or `pip3 install -r requirements.txt` as an Administrator in windows  \n`sudo python3 server.py` on *nix or `python3 server.py` as an Administrator in windows (default host interface is `0.0.0.0` and port `80`, but these can be specified via command-line arguments like so `python3 server.py <interface> <port>`)\n\n## Disclaimer\nExcept as represented in this agreement, all work product by Developer is provided ​“AS IS”. Other than as provided in this agreement, Developer makes no other warranties, express or implied, and hereby disclaims all implied warranties, including any warranty of merchantability and warranty of fitness for a particular purpose.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.distribution.manifest.list.v2+json"
  ],
  "content_types": [
    "image"
  ]
}