{
  "user": "cleanstonemc",
  "name": "cleanstone",
  "namespace": "cleanstonemc",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Scalable enterprise-style Minecraft Server",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 139,
  "last_updated": "2019-07-10T22:01:47.16813Z",
  "date_registered": "2019-05-05T22:39:22.009153Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "cleanstonemc",
  "has_starred": false,
  "full_description": "![Cleanstone](https://i.imgur.com/A5pc55f.png)\n\n[![Coverage](https://sonarcloud.io/api/project_badges/measure?project=CleanstoneMC_Cleanstone&metric=coverage)](https://sonarcloud.io/dashboard?id=CleanstoneMC_Cleanstone)\n[![Lines of Code](https://sonarcloud.io/api/project_badges/measure?project=CleanstoneMC_Cleanstone&metric=ncloc)](https://sonarcloud.io/dashboard?id=CleanstoneMC_Cleanstone)\n[![Maintainability Rating](https://sonarcloud.io/api/project_badges/measure?project=CleanstoneMC_Cleanstone&metric=sqale_rating)](https://sonarcloud.io/dashboard?id=CleanstoneMC_Cleanstone)\n[![Build Status](https://ci.codemc.org/buildStatus/icon?job=CleanstoneMC/Cleanstone)](https://ci.codemc.org/job/CleanstoneMC/job/Cleanstone)\n[![Join our Discord](https://img.shields.io/discord/429029538778054657.svg?logo=discord)](https://discord.gg/Jx5kk3u)\n## What is Cleanstone?\nThe plan is to properly build a scalable Minecraft Server from scratch without the outdated code and single-threaded nature that Minecraft was created with.\n\nWe dont just copy the vanilla server structure and refactor it. Instead we write it completely from scratch in our own way in which we focus on doing it right instead of keeping it close and similar to Vanilla Minecraft.\n\nScalable: It should be expandable e.g. you can use multiple servers for a single Minecraft world and split the load over them.\n\nMaintainable: A proper event-driven code style with dependency injection and lots of useful abstraction e.g. the protocol (built-in multi-client-version support similar to ViaVersion/ViaBackwards)\n\n## Multi-Threading\nCleanstone is multi-threaded by design since we are using multiple thread pools that balance the load of chunk loading, IO, etc.\nIn the future we want to add the possibility to balance it across multiple servers as well.\nThis is possible because we don't have a global tick loop that synchronizes all server actions but instead we outsource the work as modular services that can work asynchronously and are therefore scalable.\n\n## Features\n### Implemented\n- Multiple Network Protocols\n  - Minecraft Java Edition\n    - 1.12.2\n    - 1.13\n    - 1.13.1\n    - 1.13.2\n    - 1.14\n  - Minecraft Pocket Edtition\n    - Basic serverlist ping support\n- Async world loading and saving in LevelDB\n- Online mode login\n- Async chunk loading\n- Breaking and placing blocks (without item drops)\n- Seeing other players move around (entity tracking)\n- Command system with nice sub-command and parameter abstraction\n- Online admin panel to execute console commands\n### TODO\n- Seeing non-player entities (Missing entity metadata protocol)\n- World conversion (Missing NBT Support)\n- Item drops\n- Special block behavior (e.g. beds)\n- Spreading load over multiple servers\n- Network packet encapsulation (Events for Packets)\n- Chunk/Region behavior (Physics and AI)\n\n## No global Tick Loop?\nWe will probably not be able to avoid a tick loop completely when we get to redstone, gravity, etc. since too many other systems directly depend on it and it would cause too many race conditions and delays to synchronize it all.\nOur trick here is to divide the world into independent regions that manage their entities and work by themselves using their own worker threads and their own independent tick loops or worker servers independent of other regions.\nHowever, tasks like pathfinding and entity movement can be completely asynchronous nonetheless since nothing else depends on them.\n\n## API?\nCurrently we aren't supporting Bukkit or Sponge since we simply need more features and fundamentals first but in the future we will add support for Bukkit and probably Sponge as well, however we wont integrate it into our code but keep it separate and map it to our own API.\n\n## Discord\nWe have a Discord! Join us here: https://discord.gg/Jx5kk3u\n\n## Livedemo\nConnect to \"demo.cleanstone.rocks\" with Minecraft 1.12.2 - 1.14. The Server restarts from time to time \nwith the latest changes.\n\n## Sponsors\n[![YourKit](https://www.yourkit.com/images/yklogo.png)](https://www.yourkit.com/java/profiler/)\n\nWe are proudly using the YourKit Java Profiler to improve the performance and find high memory usage. Thank you for this amazing tool and we can fully recommend it to all Java developers! \n\nYourKit supports open source projects with its full-featured Java Profiler.\nYourKit, LLC is the creator of <a href=\"https://www.yourkit.com/java/profiler/\">YourKit Java Profiler</a>\nand <a href=\"https://www.yourkit.com/.net/profiler/\">YourKit .NET Profiler</a>,\ninnovative and intelligent tools for profiling Java and .NET applications.\n\nBanner created using JetBrains' amazing jb-rpd-splash code art generator (CC BY 4.0, https://creativecommons.org/licenses/by/4.0/)\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}