{
  "user": "covermymeds",
  "name": "dbdeployer",
  "namespace": "covermymeds",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": " Manage, track and deploy database deployments across environments and servers.",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 233254,
  "last_updated": "2021-04-02T20:20:59.020432Z",
  "date_registered": "2018-07-30T18:49:50.671785Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "covermymeds",
  "has_starred": false,
  "full_description": "Please refer to the [repo wiki](https://github.com/covermymeds/dbdeployer/wiki) for usage info, help, and more.  \n\n# DBdeployer General Info \n\nDBdeployer was developed to be a lightweight tool to manage database deployments without the need for tools like java or php and a large front end.  It is entirely written in bash and is extensible to any databases that have a command line interface and bash available.  It supports being run locally on the server or you can pass in information necessary to connect to a database remotely.\n\n# Pull Requests, Active Development\n\nThis tool was developed in house and is currently utilized throughout all of our various environments. We are still adding a lot of features but have seen major benefits from the simplicity of the code base and the ability to track our deployments.\n\nIf you would like to make a pull request, please feel free to do so and it should be reviewed relatively quickly with feedback provided and a clear expectation of when it might be merged.\n\nIf you would like to extend the script to support another database, you should be able to copy one of the dbtype folders to a new database name and then edit the things that are specifically different in your database. More information on extending the tool to support other database platforms will be available in the wiki.\n\n# Issues\n\nWe track our issues within the repo using github issues. If you find a problem and aren't sure how to fix it with a pull request, feel free to create an issue and we will see if we can fix it for you.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}