{
  "user": "dimkr",
  "name": "devsus",
  "namespace": "dimkr",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "CI/CD environment of Devsus, libre Devuan for the Asus C201",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 555,
  "last_updated": "2019-08-22T09:00:47.068713Z",
  "date_registered": "2018-11-06T17:39:33.027598Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "dimkr",
  "has_starred": false,
  "full_description": "```\n     _\n  __| | _____   _____ _   _ ___\n / _` |/ _ \\ \\ / / __| | | / __|\n| (_| |  __/\\ V /\\__ \\ |_| \\__ \\\n \\__,_|\\___| \\_/ |___/\\__,_|___/\n```\n\n[![Build Status](https://travis-ci.org/dimkr/devsus.svg?branch=master)](https://travis-ci.org/dimkr/devsus)\n\nOverview\n========\n\nDevsus is a script that builds bootable, libre [Devuan](http://www.devuan.org/) images for the Asus C201 Chromebook, one of the few laptops able to boot and run without any non-free software, all the way down to the firmware level. The C201 is supported by [Libreboot](http://www.libreboot.org/).\n\nThe images produced by Devsus contain the latest [Linux-libre](http://linux-libre.fsfla.org/) 4.9.x kernel, tuned for small size, good performance and short boot times. This kernel branch has been chosen for its [longterm](https://www.kernel.org/category/releases.html) status, which means that freedom-respecting C201 laptops are usable at least until this kernel branch is phased out.\n\nSome features of the Rockchip RK3288 SoC, including built-in WiFi support, require use of non-free software. Therefore, they are unsupported by Devsus. To compensate for that, the Devsus kernel includes support for freedom-friendly devices:\n\n* Firmware for Atheros AR9271 based WiFi dongles\n* Drivers for Qualcomm CSR8510 based Bluetooth dongles\n\nAlso, the images contain:\n* Crucial command-line tools, like those required to connect to a WiFi network\n* A [Ratpoison](https://www.nongnu.org/ratpoison/)-based, keyboard-controlled, graphical environment\n* [Firefox](https://www.mozilla.org/en-US/firefox/) ESR, pre-configured for enhanced privacy and responsiveness on the C201\n\nReleases\n========\n\nDevsus has a CI/CD flow on [Travis CI](https://travis-ci.org/dimkr/devsus), which gets triggered after each push to the master branch, or once a week.\n\nIt builds tarballs containing an up-to-date kernel, kernel modules, firmware and a Devuan root file system, then uploads the tarballs to [GitHub](https://github.com/dimkr/devsus/releases).\n\nIn order to run Devsus, one has to unpack these tarballs onto an existing bootable media, or produce bootable images using devsus.sh (see below).\n\nUsage\n=====\n\n\t# ./devsus.sh\n\nThis downloads the root file system tarball and creates two Devuan disk images:\n\n1. devuan-ascii-c201-libre-16GB.img, a 16 GB image suitable for persistent installation; its size should be exactly the size of the internal SSD\n2. devuan-ascii-c201-libre-2GB.img, a 2 GB image suitable for booting the laptop off USB\n\nTo produce a bootable media, write the 2 GB image to a flash drive (of at least 2 GB):\n\n\t# dd if=$SOMEWHERE/devuan-ascii-c201-libre-2GB.img of=/dev/$DEVICE bs=50M\n\nDuring the first boot, packages will be installed and configured. Once packages are configured, the login prompt will appear; the root password is blank.\n\nThe 2 GB image (yes, the smaller one) contains the larger, 16 GB one under /. This way, it is possible to boot the laptop through USB, then install Devuan persistently without having to download or store the large image separately.\n\nPersistent installation is performed using dd, too:\n\n\t# dd if=/devuan-ascii-c201-libre-16GB.img of=/dev/mmcblk0\n\nGraphical Desktop\n=================\n\nFirst, create a regular user:\n\n\t# useradd -m -s /bin/bash user_name_goes_here\n\t# passwd user_name_goes_here\n\nThen, log in as the new user.\n\nTo start the graphical desktop:\n\n\t$ startx\n\nThe browser and the terminal are started automatically.\n\nThe window manager is controlled using the keyboard:\n\n* Search + c spawns a new terminal window\n* Search + n switches to the next window\n* Search + p switches to the previous window\n* Search + k closes a window\n* Search + ! run a shell command\n\nThe special actions of function keys are triggered by pressing them together with the control key.\n\nFor a list of all key bindings:\n\n\t$ man ratpoison\n\t$ cat ~/.xbindkeysrc\n\nCredits and Legal Information\n=============================\n\nDevsus' previous kernel building procedure was based on the linux-veyron package\nof [Arch Linux ARM](http://www.archlinuxarm.org/).\n\nDevsus' workaround for ath9k_htc instability issues has been adopted from [PrawnOS](https://github.com/SolidHal/PrawnOS) and found by SolidHal.\n\nDevsus is free and unencumbered software released under the terms of the GNU General Public License, version 2; see COPYING for the license text. For a list of its authors and contributors, see AUTHORS.\n\nThe ASCII art logo at the top was made using [FIGlet](http://www.figlet.org/).\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}