{
  "user": "dogbin",
  "name": "dogbin",
  "namespace": "dogbin",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 1,
  "pull_count": 43711,
  "last_updated": "2020-05-15T08:27:45.55676Z",
  "date_registered": "2019-11-26T12:59:57.014112Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "dogbin",
  "has_starred": false,
  "full_description": "# dogbin - the sexiest pastebin and url shortener ever!\nSharing short code samples, logs, links or markdown notes is now easier than ever!\n\n## Basics\nThe easiest way to use dogbin, is from inside your browser. Type or paste your content\ninto the text area on the homepage (`ctrl + n`), save it (`ctrl + s`) and copy the link.\nYou can now share this link with whoever you want.\n\nIf you want to create a short url from a link, simply paste the link in the text field.\nYou can now copy the resulting link and it will automatically redirect everyone.\n\n### Editing\nYou can edit your documents by clicking the edit button (or `ctrl + e`).\n\nWhen you create your first document we will automatically create an (anonymous) account \nfor you, so you will be able to edit your documents for as long as you keep our cookie. \nIf you want a more permanent way to keep your pastes and edit them from multiple devices\nyou can [create an account](/register). Pastes which you created before signing up will\nbe automatically transferred to your account.\n\n### Custom URL\nIf you want to use a custom slug (the part after `del.dog/`) you can do so by entering\nyour desired url in the `Custom URL` field.\n\n### Document lifetime\nThere is no explicit expiration time for documents on dogbin. Documents may however be\nremoved at any time without notice.\n\n## Using from the command line\nYou can easily use dogbin from the command line with our official command line client [inu](/inu).\n\n## API usage\nThe basic dogbin api is an extension of the hastebin API. Extensions include the ability to \nspecify a custom slug, and the `X-Api-Key` header.\n\nA more complete documentation and a full rest API (allowing for custom frontends) will be\navailable soon.\n\n## Privacy\ndogbin is a product which actually values your privacy. We are almost fully compliant with\nthe [EFF DNT policy](https://www.eff.org/dnt-policy) (our goal is to be fully compliant by January 2020). We only use cookies for authentication\nand (apart from editing) all website features should be usable with cookies disabled.\n\nPlease note that **all documents** are currently indexable by search engines.\n\nAnalytics are only collected when allowed by the useragent and our analytics platform\n([Simple Analytics](https://simpleanalytics.io)) uses no cookies and guarantees full privacy.\nAll our analytics are publicly available [here](/analytics).\n\n> You can get 1 month of Simple Analytics for free using [my referral link](https://referral.simpleanalytics.com/deletescape).\n\n## Open Source\ndogbin is fully open source and built on open source technology. All sources can be\nfound on [GitHub](/github). You can easily deploy it yourself wherever you want.\n\n## News and Updates\n\nYou can join our [Telegram Channel](https://t.me/dogbin) to get updates on maintenance and new features.   \n\n## Donations\nI'm running dogbin in my free time, and unfortunately servers aren't free. The traffic \nand required storage is continuously increasing (and thus also server cost). You can financially \nsupport me via [GitHub Sponsors](https://github.com/sponsors/deletescape), [Liberapay](https://liberapay.com/deletescape) or [PayPal](https://paypal.me/deletescape).\n\n## Contact\nYou can contact deletescape [here](https://deletescape.ch/contact).",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}