{
  "user": "fossology",
  "name": "fossology",
  "namespace": "fossology",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "FOSSology is a open source license compliance software system and toolkit.",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 28,
  "pull_count": 918225,
  "last_updated": "2023-01-02T10:19:06.669279Z",
  "date_registered": "2016-04-15T14:20:14.670684Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "fossology",
  "has_starred": false,
  "full_description": "# FOSSology\n\n[![GPL-2.0](https://img.shields.io/github/license/fossology/fossology)](LICENSE)\n[![Travis-CI Build Status](https://travis-ci.org/fossology/fossology.svg?branch=master)](https://travis-ci.org/fossology/fossology)\n[![CII Best Practices](https://bestpractices.coreinfrastructure.org/projects/2395/badge)](https://bestpractices.coreinfrastructure.org/projects/2395)\n[![Coverage Status](https://coveralls.io/repos/github/fossology/fossology/badge.svg?branch=master)](https://coveralls.io/github/fossology/fossology?branch=master)\n[![Slack Channel](https://img.shields.io/badge/slack-fossology-blue.svg?longCache=true&logo=slack)](https://join.slack.com/t/fossology/shared_invite/enQtNzI0OTEzMTk0MjYzLTYyZWQxNDc0N2JiZGU2YmI3YmI1NjE4NDVjOGYxMTVjNGY3Y2MzZmM1OGZmMWI5NTRjMzJlNjExZGU2N2I5NGY)\n[![GitHub release (latest by date)](https://img.shields.io/github/v/release/fossology/fossology)](https://github.com/fossology/fossology/releases/latest)\n[![YouTube Channel](https://img.shields.io/badge/youtube-FOSSology-red.svg?&logo=youtube&link=https://www.youtube.com/channel/UCZGPJnQZVnEPQWxOuNamLpw)](https://www.youtube.com/channel/UCZGPJnQZVnEPQWxOuNamLpw)\n\n## About\n\nFOSSology is an open source license compliance software system and toolkit. As a toolkit, you can run license, copyright and export control scans from the command line. As a system, a database and web UI are provided to give you a compliance workflow. In one click you can generate an SPDX file or a ReadMe with all the copyrights notices from your software. FOSSology deduplication means that you can scan an entire distro, rescan a new version, and only the changed files will get rescanned. This is a big time saver for large projects.\n\n[Check out Who Uses FOSSology!](https://www.fossology.org)\n\nFOSSology does not give legal advice.\nhttps://fossology.org/\n\n## Requirements\n\nThe PHP versions 7.x are supported to work for FOSSology. FOSSology requires Postgresql as the database server and apache httpd 2.6 as the web server. These and more dependencies are installed by `utils/fo-installdeps`.\n\n## Installation\n\nFOSSology should work with many Linux distributions.\n\nSee https://github.com/fossology/fossology/releases for source code download of the releases.\n\nFor installation instructions see [Install from Source](https://github.com/fossology/fossology/wiki/Install-from-Source)\npage in [Github Wiki](https://github.com/fossology/fossology/wiki)\n\n## Docker\n\nFOSSology comes with a Dockerfile allowing the containerized execution\nboth as a single instance or in combination with an external PostgreSQL database.\n**Note:** It is strongly recommended to use an external database for production\nuse since the standalone image does not take care of data persistency.\n\nA pre-built Docker image is available from [Docker Hub](https://hub.docker.com/r/fossology/fossology/) and can be run using the following command:\n``` sh\ndocker run -p 8081:80 fossology/fossology\n```\n\nThe docker image can then be used using http://IP_OF_DOCKER_HOST:8081/repo user fossy passwd fossy.\n\nExecution with external database container can be done using Docker Compose, via the following command:\n``` sh\ndocker-compose up\n```\n\nThe Docker image allows the configuration of its database connection over a set of environment variables.\n\n- **FOSSOLOGY_DB_HOST:** Hostname of the PostgreSQL database server.\n  An integrated PostgreSQL instance is used if not defined or set to `localhost`.\n- **FOSSOLOGY_DB_NAME:** Name of the PostgreSQL database. Defaults to `fossology`.\n- **FOSSOLOGY_DB_USER:** User to be used for PostgreSQL connection. Defaults to `fossy`.\n- **FOSSOLOGY_DB_PASSWORD:** Password to be used for PostgreSQL connection. Defaults to `fossy`.\n\n## Vagrant\n\nFOSSology comes with a VagrantFile that can be used to create an isolated environment for FOSSology and its dependencies.\n\n**Pre-requisites:**  Vagrant >= 2.x and Virtualbox >= 5.2.x\n\n**Steps:**\n\n```\ngit clone https://github.com/fossology/fossology\ncd fossology/\nvagrant up\n```\n\nThe server must be ready at [http://localhost:8081/repo/](http://localhost:8081/repo/). The login credentials are:\n\n```\nuser: fossy\npass: fossy\n```\n\n## Test Instance\n\nFor trying out FOSSology quickly, a test instance is also available at [https://fossology.osuosl.org/](https://fossology.osuosl.org/). **This instance can be deleted or reinstalled at any time, thus it is not suitable for serving as your productive version**. The login credentials are as follows:\n\n```\nUsername: fossy\nPassword: fossy\n```\n\n**Note:** The test instance is not up to date with the latest release. The instance will reset every night at 2 am UTC and all the user uploaded data will be lost.\n\n## Documentation\n\nWe are currently migrating our documentation to Github. At this stage, you can find general documentation at:\nhttps://www.fossology.org/get-started/basic-workflow/\nand developer docs on [Github Wiki](https://github.com/fossology/fossology/wiki) and https://fossology.github.io/\n\n## Support\n\nMailing lists, FAQs, Release Notes, and other useful info is available\nby clicking the documentation tab on the project website. We encourage\nall users to join the mailing list and participate in discussions.\nThere is also a #fossology IRC channel on the freenode IRC network if\nyou'd like to talk to other FOSSology users and developers.\nSee [Contact Us](https://www.fossology.org/about/contact/)\n\n## Contributing\n\nWe really like contributions in several forms, see [CONTRIBUTING.md](CONTRIBUTING.md)\n\n## Licensing\n\nThe original FOSSology source code and associated documentation\nincluding these web pages are Copyright (C) 2007-2012 HP Development\nCompany, L.P. In the past years, other contributors added source code\nand documentation to the project, see the NOTICES file or the referring\nfiles for more information.\n\nAny modifications or additions to source code or documentation\ncontributed to the FOSSology project are Copyright (C) the contributor,\nand should be noted as such in the comments section of the modified file(s).\n\nFOSSology is licensed under [GPL-2.0](https://tldrlegal.com/license/gnu-general-public-license-v2)\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; version 2 of the License\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nException:\n\nAll of the FOSSology source code is licensed under the terms of the GNU\nGeneral Public License version 2, with the following exceptions:\n\nlibfossdb and libfossrepo libraries are licensed under the terms of\nthe GNU Lesser General Public License version 2.1, [LGPL-2.1](https://tldrlegal.com/license/gnu-lesser-general-public-license-v2.1-(lgpl-2.1)).\n\n    This library is free software; you can redistribute it and/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 2.1 of the License.\n\n    This library is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    Lesser General Public License for more details.\n\n    You should have received a copy of the GNU Lesser General Public\n    License along with this library; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA\n    02110-1301  USA\n\nPlease see the LICENSE file included with this software for the full texts of\nthese licenses.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}