{
  "user": "humanprotocol",
  "name": "hmt-escrow",
  "namespace": "humanprotocol",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "A python library to launch escrow contracts to the HUMAN network.",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 147,
  "last_updated": "2021-04-28T16:31:49.303919Z",
  "date_registered": "2021-02-24T10:33:53.267538Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "imcirw",
  "has_starred": false,
  "full_description": "# <img height=\"60px\" src=\"./static/human.svg\" alt=\"human\" />\n\n# Help Wanted!\n\nHCaptcha’s bounty program is the easiest way to get a job working with us. Most of our development comes from the founders of hmt-escrow, bounties from open source developers, or developers hired from the bounty program. Take a look at our issues or suggest a new one, and a mod will add it to the bounty program. Read the documentation as it contains information for working with us.\n\nReward sizes are guided by the rules below and payable in USD via PayPal. If you prefer, you may also elect to have your reward donated to a registered charity of your choice that accepts online donations, subject to approval of the charity.\n\n    - Larger or Critical: $100 - $500\n    - Small: up to $100\n\n## Installation\n\n### Manual\n\nYou need few essential system requirements to successfully install our Python 3 package.\n\n### Annoying testing feature\nRightly or Wrongly we tried to use doctests for the vast majority of testing in this project\n. As a result you may have to remove the raise_on_error=True in the module you are testing\nto get good feedback on what's broken.\n\n\n#### Debian / Ubuntu\n\nWe'd recommend you checking out the dockerfile for an explanation of what applications are required\n\nAfter that the following command should install the package successfully:\n\n```\npip install git+https://github.com/iamdefinitelyahuman/py-solc-x@master#egg=py-solc-x \\\n            git+https://github.com/ethereum/trinity@master#egg=trinity \\\n            git+https://github.com/sphinx-doc/sphinx@master#egg=sphinx\n\npip install hmt-escrow\n```\n### Docker\n\nIn order to build the image you need [Docker](https://www.docker.com/) installed on your computer.\n\nWe have gathered relevant commands in the `bin/` folder.\n\nYou can run the project with `bin/prelaunch`.\n\n\n### Getting Started\n\nCreating a new HUMAN Protocol Job requires a manifest and credentials at minimum. Optionally a factory \naddress and/or an escrow address can be given. Using an existing factory address can be used to deploy \na new Job to the Ethereum network. Using an existing factory address and escrow address together an \nexisting Job on the Ethereum network can be accessed. Creating a Job without a factory address deploys \na fresh factory to the Ethereum network.\n\nA Manifest has to follow the specification at https://github.com/hCaptcha/hmt-basemodels\n\nCredentials must follow the following format:\n```\n>>> credentials = {\n... \t\"gas_payer\": \"0x1413862C2B7054CDbfdc181B83962CB0FC11fD92\",\n... \t\"gas_payer_priv\": \"28e516f1e2f99e96a48a23cea1f94ee5f073403a1c68e818263f0eb898f1c8e5\"\n... }\n>>> rep_oracle_pub_key = b\"2dbc2c2c86052702e7c219339514b2e8bd4687ba1236c478ad41b43330b08488c12c8c1797aa181f3a4596a1bd8a0c18344ea44d6655f61fa73e56e743f79e0d\"\n```\n\nUsing only the Manifest and Credentials deploys a new factory to the Ethereum network\nwith the public key of a known Reputation Oracle.\n```\n>>> job = Job(credentials, manifest)\n>>> job.launch(rep_oracle_pub_key)\nTrue\n```\n\nProviding an existing factory address is done via the Job's class attributes.\n```\n>>> factory_addr = deploy_factory(**credentials)\n>>> job = Job(credentials, manifest, factory_addr)\n>>> job.launch(rep_oracle_pub_key)\nTrue\n```\n\nYou can supply an existing escrow factory address when instantiating the class, which \nit will use to do all operations. If an escrow factory address is not given, it creates one. \n\nCredentials have to contain the private key that was used to upload\nthe previously deployed manifest to IPFS. The Job is instantiated with the fetched\nmanifest.\n\n```\n>>> credentials = {\n... \t\"gas_payer\": \"0x1413862C2B7054CDbfdc181B83962CB0FC11fD92\",\n... \t\"gas_payer_priv\": \"28e516f1e2f99e96a48a23cea1f94ee5f073403a1c68e818263f0eb898f1c8e5\",\n...     \"rep_oracle_priv_key\": b\"28e516f1e2f99e96a48a23cea1f94ee5f073403a1c68e818263f0eb898f1c8e5\"\n... }\n\n>>> factory_addr = deploy_factory(**credentials)\n>>> escrow_addr = job.job_contract.address\n```\n\nIf you provide an `escrow_addr` and a `factory_addr` the library will check \nwhether that `escrow_addr` belongs to the `factory_addr`. If that succeeds \nyou can continue from the state the contract is in.\n\nA Job can only be launched once: calling `launch()` will return False if\nyou previously launched it.\n\n```\n>>> accessed_job = Job(credentials=credentials, factory_addr=factory_addr, escrow_addr=escrow_addr)\n>>> accessed_job.launch(rep_oracle_pub_key)\nFalse\n```\n\nCalling setup funds the deployed escrow contract and updates its state with data from the manifest.\n```\n>>> job.setup()\nTrue\n```\n\nWhile no payouts have been performed, aborting and canceling a job is still possible.\n```\n>>> job.abort()\nTrue\n>>> job.cancel()\nTrue\n```\n\nPerforming a bulk payout that doesn't fully drain the escrow contract sets the contract to\nPartial state. It also uploads the final results from the Reputation Oracle to the contract's\nstate.\n```\n>>> payouts = [(\"0x6b7E3C31F34cF38d1DFC1D9A8A59482028395809\", Decimal('20.0'))]\n>>> job.bulk_payout(payouts, {}, rep_oracle_pub_key)\nTrue\n>>> job.status()\n<Status.Partial: 3>\n```\n\nDraining the escrow contract fully sets the contract to Paid state.\n```\n>>> payouts = [(\"0x6b7E3C31F34cF38d1DFC1D9A8A59482028395809\", Decimal('80.0'))]\n>>> job.bulk_payout(payouts, {}, rep_oracle_pub_key)\nTrue\n>>> job.status()\n<Status.Paid: 4>\n```\n\nCompleting the job sets a Paid contract to complete.\n```\n>>> job.complete()\nTrue\n>>> job.status()\n<Status.Partial: 5>\n```\n\n## Note for maintainers: Deploying to PyPi\n\nA build will automatically be deployed to PyPi from master if tagged with a version number.  This version number should  match the version in the `setup.py` file.\n\nThe tags will need to be pushed to master via a user that has the proper privileges (see the contributors of this repo).  \n\nVersioning should follow the [semver](https://semver.org/) versioning methodology and not introduce breaking changes on minor or patch-level changes.\n\n## Have a question?\n\nJoin our [Telegram](https://t.me/hcaptchachat) channel, we will gladly answer your questions.\n\n## Found a bug or a feature request?\n\nPlease search for any existing issues at our [Issues](https://github.com/IntuitionMachines/hmt-contracts/issues) page before submitting your own. If you submit your own, please follow our `Bug Request` and `Feature Request` templates.\n\nAlso check our [Bug Bounty Program](https://github.com/hCaptcha/bounties) and [Bounty Issues](https://github.com/hCaptcha/hmt-escrow/issues?q=is%3Aopen+is%3Aissue+label%3Abounty).\n\n## Contributions\n\nInteresting in contributing to the project? Please see our [Contributing guidelines](CONTRIBUTING.md) and check our instructions for setting up the project and getting your commits to the codebase.\n\n## License\n\nMIT © HUMAN Protocol\n\n## Audit Status\n\nThe HUMAN Protocol token contract (HMToken.sol) has been audited by several third parties, most recently CertiK. You can see the results of this audit in the `audits` directory. The code for this contract is stable and not expected to change materially in the future.\n\nThe escrow factory and related code are under active development, and escrow factories on the testnet are frequently launched during development. \n\nAlthough all code goes through internal reviews before being committed, you should assume the current code in master has not been externally audited to the same degree as the token contract. \n\nWhen a stable 1.0 version of the escrow factory contract is released, this section of the README will be updated with a link to audit results for that githash.\n\n## Note to bug hunters and those deploying to production\n\nThe docker-compose.yml references a default minio username and password for development. minio as used here is an internal cache for low-privilege, publicly readable, encrypted data. Including these default credentials for development is intentional. \n\nWhen deploying to a production environment you are expected to set your own credentials based on the rules applied to minio access within your cluster.\n\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}