{
  "user": "jkirkcaldy",
  "name": "plex-utills",
  "namespace": "jkirkcaldy",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Manage your plex library with some python scripts. ",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 1,
  "pull_count": 258819,
  "last_updated": "2022-12-13T16:50:31.242806Z",
  "date_registered": "2021-07-27T21:13:30.038202Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "jkirkcaldy",
  "has_starred": false,
  "full_description": "# plex-utills\n\n## MASSIVE UPDATE!\n---\nThe whole app now runs in a webui. This should make things easier for those who are not as comfortable in the commandline or just prefer a ui. \n\nI have also removed a couple of the config elements, namely, the PLEXPATH and MOUNTEDPATH options. These are now handled directly by the application and Docker. When you pass through you plex media directory, the app will automatically map this and find your plex path to make the config easier. Now as long as the container has write access to the media directory, it should make enabling the backup posters much easier. \n\nThere is an option to automatically migrate your old config files into the new ui for easier migration. \n\nNew HDR banners along with a script to migrate from the old banners to the new ones should you wish to use them. You can stick with the old banners if you would like. \n\nThe new scripts us TheMoviedb for finidng posters and metadata, so for maximum compatability and fewer issues, these work best when using TheMoviedb as your metadata agent. Trhoughout my testing, it is only sequals that were giving me issues, as the Plex scanner will name your films like: \n\nBoss Baby 2: Family Business\n\nWhereas on TheMoviedb it is named:\n\nBoss Baby: Family Business \n\nThis means that the search for the film can fail in the script. \n\n### New Features:\nGUI for managing the application in a browser\n\nAdd 4k mini banners to your 4K TV episodes. \n\nNew HDR banner design\nDolby Vision HDR Banner\nHDR10 Banner\n\nMigration scripts for moving from the old config files to the new datbase and for moving from the old HDR banner to the new designs. \n\n\n## Features\n\n### 4K/HDR Posters\n\n\n\nThis script will go through your library and add a 4k banner to your posters. Configurable options include:\n\n-   Selecting full width banners or mini corner banners\n-   enabling HDR banners\n-   Backup your original posters alongside your media\n\nThis can be run on both your films library and your TV shows Library. If enabled on your TV shows, a mini 4K banner will be added to each of your 4K epiisodes, not the season posters. This is due to the possibility of having Shows/Seasons with mixed resolutions. TV shows will be done at the same time as film posters.\n\n\n### 3D Posters\n\n\nMuch like the 4K poster script, this will go through your films and add a 3D banner to your films. Currently as Plex has no support for labelling content as 3D this will only work for 3D films kept in a separate library. You can configure the script to have full width banners or the mini corner banners as well as backing up your posters.\n\nAvailable Banners\n-----------------\n\n* * * * *\n\n#### The 4K/3D banners will be combined with the HDR posters if they are enabled.\n\n \n<table class=\"tg\">\n  <tr>\n    <th class=\"tg-0pky\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/4k_banner.png\" alt=\"Image\" width=\"200\" height=\"300\"></th>\n    <th class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/mini4k.png\" width=\"200\" height=\"300\"></th>\n    <th class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/3D_banner.png\" width=\"200\" height=\"300\"></th>\n    <th class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/mini3d.png\" width=\"200\" height=\"300\"></th>\n  </tr>\n  <tr>\n    <td class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/old_hdr.png\" width=\"200\" height=\"300\"></td>\n    <td class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/new_hdr.png\" width=\"200\" height=\"300\"></td>\n    <td class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/new_dolby_vision.png\" width=\"200\" height=\"300\"></td>\n    <td class=\"tg-0lax\"><img src=\"https://raw.githubusercontent.com/jkirkcaldy/plex-utills/f0d354387c1010d55066ae971c8f44874ca11906/app/img/Examples/new_hdr10.png\" width=\"200\" height=\"300\"></td>\n  </tr>\n</table>\n\n\n\n### Hide 4K\n\nFor those of you who don't separate your 4K and non-4K content into separate libraries. This script will go through your films library and add an \"Untranscodable\" tag to any of your films that only have a single 4K copy of the film available. By adding this tag to your users restrictions, they simply won't see these 4K films giving your hardware a break.\n\nIf your hardware is powerful enough, there is the option to create an optimized version so that your users can play this version. This will send your film to be optimized with the Plex optimize feature baked directly into Plex. This means all the hardwork is done by your plex server, (useful if you're hosting these scripts on a lower powered device.) Once the transcode has finished, the untranscodable tag will be removed the next time the script runs and your users will be able to see the film.\n\n### Disney Collection\n\n\n\nWhere this whole project started. A simple script, that will go through your films library and add any film from the Disney Studio into a Disney collection.\n\n### Pixar Collection\n\nAs above only with Pixar Films\n\n****\n\n# How to Install\n\nThis update has been designed to run in docker only. \n\nOn Unraid: \nInstall from communtiy apps, mount your plex media and config file location if you wish to use the migrate function. \n\nIn a browser go to http://<your_unraid_ip>:5000\n\n****\nFor a docker on any other system, run \n\n`docker run -d -p 5000:5000 -v <your/plex/media>:/films -v <mount/your/logs>:/logs -e TZ=Europe/london -e PUID=1000 -e PGUI=1000 jkirkcaldy/plex-utills`\n\nIf you want to migrate from the old config file, simply mount your your config as you did before:\n\n`docker run -d -p 5000:5000 -v <your/plex/media>:/films -v <mount/your/logs>:/logs -v <your/config>:/config -e TZ=Europe/london -e PUID=1000 -e PGUI=1000 jkirkcaldy/plex-utills`\n\nOnce done visit http://<your_ip>:5000 to continue. ",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}