{
  "user": "lovetheidea",
  "name": "moadb",
  "namespace": "lovetheidea",
  "repository_type": null,
  "status": 0,
  "status_description": "initialized",
  "description": "Moa(db) is a open source PHP MongoDB GUI. Amazing lightweight UI and much more in the box.",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 11,
  "last_updated": "2016-06-16T18:38:16.916155Z",
  "date_registered": "2016-06-16T18:38:16.916155Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "lovetheidea",
  "has_starred": false,
  "full_description": "What is moa(db)?\n\nMoa(db) is a open source PHP MongoDB GUI. The project is focused on a very simple interface and a drag & drop setup. Helpful query validation, amazing lightweight UI , JSON imports & exports, SSL support and much more in the box.\n\nBrowsers\n\nchrome  firefox  safari\n\nChome, Firefox, Safari. Some call it a limitation, but I'am calling it a feature: No support for IE at this time.\n\nGetting Started\n\nmoa(db) works with PHP5+ and requires Mongo PHP Driver to be installed and running.\n\nTo setup moa(db) :\n\n- Copy the `moaDB` folder to a secure path on your web site.\nThen your done, but you might want to :\n\n- Change the `.htaccess` file in order to block unwanted authorization.\n- Check out the config settings in `resources/php/config.php`.\nFinally go to the URL pointing to moaDB on your web site.\n\nStatus\n\nThis project is new and a work in progress. Bugs, issues and improvements are very welcome.\n\nHistory\n\n** [1.0.1] **\n- Docker support;\n\n** [1.0.0] **\n- Initial commit;\n\nContribute\n\nThis project started out as a quick fix, for a GUI to support mongo ssl, but I have now decided to continue improving it and share the love. Feel free to contribute to MoaDB. Make sure your methods are tested on the support browsers, and that any new functionality includes appropriate comments.",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [],
  "content_types": []
}