{
  "user": "lynnesbian",
  "name": "mstdn-ebooks",
  "namespace": "lynnesbian",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Docker build for mstdn-ebooks",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 283,
  "last_updated": "2021-07-19T19:17:14.385417Z",
  "date_registered": "2018-11-14T19:44:57.828056Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "lynnesbian",
  "has_starred": false,
  "full_description": "# mstdn-ebooks\n**Lynnear Edition**\n\nThis version makes quite a few changes from [the original](https://github.com/Jess3Jane/mastodon-ebooks), such as:\n- Unicode support\n- Non-Markov stuff\n- Stores toots in a sqlite database rather than a text file\n  - Doesn't unnecessarily redownload all toots every time\n\n## FediBooks\nBefore you use mstdn-ebooks to create your own ebooks bot, I recommend checking out [FediBooks](https://fedibooks.com). Compared to mstdn-ebooks, FediBooks offers a few advantages:\n- Hosted and maintained by someone else - you don't have to worry about updating, keeping the computer on, etc\n- No installation required\n- A nice UI for managing your bot(s)\n- Easy configuration\n\nHowever, there are still a few reasons you might want to use mstdn-ebooks instead:\n- Your data stays local to your machine\n- More customisation potential - you can edit mstdn-ebooks to add functionality\n- Replying more (in)frequently than FediBooks allows\n\nLike mstdn-ebooks, FediBooks is free, both as in free of charge and free to modify, self-host, and more.\n\n## Secure Fetch\nSecure fetch (aka authorised fetches, authenticated fetches, secure mode...) is *not* supported by mstdn-ebooks, and will fail to download any posts from users on instances with secure fetch enabled. For more information, see [this wiki page](https://github.com/Lynnesbian/mstdn-ebooks/wiki/Secure-fetch).\n\n## Install/usage Guide\nAn installation and usage guide is available [here](https://cloud.lynnesbian.space/s/jozbRi69t4TpD95). It's primarily targeted at Linux, but it should be possible on BSD, macOS, etc. I've also put some effort into providing steps for Windows, but I can't make any guarantees as to its effectiveness.\n\n### Docker\nWhile there is a Docker version provided, it is **not guaranteed to work**. I personally don't use Docker and don't know how the Dockerfile works; it was create over a year ago by someone else and hasn't been updated since. It might work for you, it might not. If you'd like to help update the Dockerfile, please get in touch with me on the Fediverse.\n\n## Compatibility\n| Software  | Downloading statuses                                              | Posting | Replying                                                    |\n|-----------|-------------------------------------------------------------------|---------|-------------------------------------------------------------|\n| Mastodon  | Yes                                                               | Yes     | Yes                                                         |\n| Pleroma   | [Somewhat](https://git.pleroma.social/pleroma/pleroma/issues/866) | Yes     | [No](https://git.pleroma.social/pleroma/pleroma/issues/416) |\n| Misskey   | Yes                                                               | No      | No                                                          |\n| diaspora* | [No](https://github.com/diaspora/diaspora/issues/7422)            | No      | No                                                          |\n| Others    | Maybe                                                             | No      | No                                                          |\n\n*Note: Bots are only supported on Mastodon and Pleroma instances. Bots can learn from users on other instances, but the bot itself must run on either a Mastodon or Pleroma instance.*\n\nmstdn-ebooks uses ActivityPub to download posts. This means that it is not dependant on any particular server software, and should work with anything that (properly) implements ActivityPub. Any software that does not support ActivityPub (e.g. diaspora*) is not supported, and won't work.\n\nI recommend that you create your bot's account on a Mastodon instance. Creating a bot on a Pleroma instance means that your bot will be unable to reply, although posting will work just fine. However, even if your bot is on a Mastodon instance, it will be able to learn from any Pleroma or Misskey users just fine.\n\n## Configuration\nConfiguring mstdn-ebooks is accomplished by editing `config.json`. If you want to use a different file for configuration, specify it with the `--cfg` argument. For example, if you want to use `/home/lynne/c.json` instead, you would run `python3 main.py --cfg /home/lynne/c.json` instead of just `python3 main.py`\n\n| Setting | Default | Meaning |\n|--------------------|------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| site | https://botsin.space | The instance your bot will log in to and post from. This must start with `https://` or `http://` (preferably the latter) |\n| cw | null | The content warning (aka subject) mstdn-ebooks will apply to non-error posts. |\n| instance_blacklist | [\"bofa.lol\", \"witches.town\", \"knzk.me\"] | If your bot is following someone from a blacklisted instance, it will skip over them and not download their posts. This is useful for ensuring that mstdn-ebooks doesn't waste time trying to download posts from dead instances, without you having to unfollow the user(s) from them. |\n| learn_from_cw | false |  If true, mstdn-ebooks will learn from CW'd posts. |\n| mention_handling | 1 |  0: Never use mentions. 1: Only generate fake mentions in the middle of posts, never at the start. 2: Use mentions as normal (old behaviour). |\n| max_thread_length | 15 | The maximum number of bot posts in a thread before it stops replying. A thread can be 10 or 10000 posts long, but the bot will stop after it has posted `max_thread_length` times. |\n| strip_paired_punctuation | false | If true, mstdn-ebooks will remove punctuation that commonly appears in pairs, like \" and (). This avoids the issue of posts that open a bracket (or quote) without closing it. |\n\n## Donating\nPlease don't feel obligated to donate at all.\n\n- [Ko-Fi](https://ko-fi.com/lynnesbian) allows you to make one-off payments in increments of AU$3. These payments are not taxed.\n- [PayPal](https://paypal.me/lynnesbian) allows you to make one-off payments of any amount in a range of currencies. These payments may be taxed.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}