{
  "user": "mayuresh82",
  "name": "gocast",
  "namespace": "mayuresh82",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Gocast is a tool for controlled BGP route announcements from a host",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 6067127,
  "last_updated": "2021-05-14T16:43:11.851191Z",
  "date_registered": "2018-10-23T18:09:07.970588Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "mayuresh82",
  "has_starred": false,
  "full_description": "# GoCast\n\nGocast is a tool that does controller BGP route advertisements from a host. It runs custom defined healthchecks and announces or withdraws routes (most commonly VIPs or Virtual IPs) to a BGP peer.\nThe most common use case for this is anycast (vip) based load balancing for infrastructure services such as DNS, Syslog etc where several instances are available in geographically diverse regions that announce the same anycast VIP, and clients then get sent to the closest instance.\n\n## Installation\nUse the docker container at mayuresh82/gocast or compile from source:\n\n1. [Install Go](https://golang.org/doc/install)\n2. [Setup your GOPATH](https://golang.org/doc/code.html#GOPATH)\n3. Run `go get -d github.com/mayuresh82/gocast`\n4. Run `cd $GOPATH/src/github.com/mayuresh82/gocast`\n5. Run `make`\n\n## Design\n\nGoCast uses [GoBGP](https://github.com/osrg/gobgp) as a library to peer with remote neighbors and announce/withdraw prefixes. It really is just a healthcheck based wrapper around GoBGP. Remote peers can be autodiscovered or statically configured. A peer will most commonly be a Top-Of-Rack (TOR) switch.\n\nTypically you would run GoCast on the same hosts as the service that needs to be monitored.\nOnce an application \"registers\" with GoCast, GoCast then runs the predefined health monitors/checks and if they fail (e.g a service listening on a specific port), the routes are withdrawn thereby taking the node out of service.\n\nGoCast uses a config file to define agent parameters (http addr, consul server addr, timers etc) and BGP parameters (local/peer ASN, peer IP, origin/communnities). See example config.yaml.\n\n### Registration\nAn application can register with the GoCast instance running on the same host using one of the following methods:\n1. http call : Make an http get call with the required parameters. For example:\n```\nhttp://gocast-addr/register?name=<appName>&vip=<addr/mask>&monitor=port:tcp:5000\n```\nMultiple monitors can be defined and the healthcheck succeeds only when all the monitors pass.\n\n2. Custom defined apps in config.yaml. See the example config.yaml for syntax examples\n\n3. Consul based auto-discovery (see below)\n\n## Monitors\nA health monitor can either be a port monitor, an exec monitor or consul. Port monitors are specified as *port:protocol:portnum* , exec monitors run a script or arbitrary command and pass on successful exit (status code 0), specified as *exec:command* and consul monitors use consul's own healthchecks, specifed simply as *consul*\n\n## Consul Integration\nGoCast supports consul for automatic service discovery and healthchecking. For this to work, the following needs to be setup:\n- The host running GoCast needs to have the environment variable **CONSUL_NODE** set to the hostname in consul\n\n- The following tags must be set in consul for autodiscovery to work:\n\n`enable_gocast` : required\n\n`gocast_vip=<addr/mask>`: required\n\n`gocast_monitor=monitor:params`: optional\n\nIf `gocast_monitor=consul` is specified, then GoCast uses the defined healthchecks in consul as the health monitors for the service.\n\n## Docker support\nThe docker image at mayuresh82/gocast can be used to run GoCast inside a container. In order for GoCast to manipulate the host network stack correctly, the container needs to run with NET_ADMIN capablity and host mode networking. For example:\n```\ndocker run -d --cap-add=NET_ADMIN --net=host -v /path/to/host-config:/path/to/container-config mayuresh82/gocast -config=/path/to/config.yaml -logtostderr\n```\n\n**Caveats and workarounds**\n\nThe service to be monitored can also be run inside a container, provided the published service ports are set to listen on 0.0.0.0 (not a specific IP.)\nCertain orchestration solutions such as Nomad run the docker containers with published ports listening only on the physical IP address. This will cause all requests to the app to fail, because the host does not listen on the loopback interface any more (which GoCast uses and assigns the VIP IP to). To work=around this there are 2 options:\n\n- Start the service container in host networking mode OR\n\n- Register NAT rules for your service with GoCast for the required protocol/port(s). GoCast will then create iptables NAT rules that map traffic destined to the assigned VIP to the physical IP address. This is achieved by adding the `nat=protocol:port` tag(s) in consul or the http query.\n\n**Why not just use ExaBGP or something similar ?**\n\nExaBGP is commonly used for this purpose, with bash scripts and such.  However, I found that there no standard way of doing things and there is little to no support for containerized services. Also ExaBGP's API is clunky and documentation is almost non existent. GoCast provides an out of the box solution without hacking together a bunch of scripts.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}