{
  "user": "nidhugg",
  "name": "nidhugg",
  "namespace": "nidhugg",
  "repository_type": null,
  "status": 0,
  "status_description": "initialized",
  "description": "A bug-finding tool which targets bugs caused by concurrency and relaxed memory consistency",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 0,
  "last_updated": "2020-02-21T10:22:30.254127Z",
  "date_registered": "2020-02-21T10:22:30.254127Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "nidhugg",
  "has_starred": false,
  "full_description": "Nidhugg\n=======\n\nNidhugg is a bug-finding tool which targets bugs caused by concurrency\nand relaxed memory consistency in concurrent programs. It works on the\nlevel of LLVM internal representation, which means that it can be used\nfor programs written in languages such as C or C++.\n\nCurrently Nidhugg supports the SC, TSO, PSO, POWER and ARM memory\nmodels. Target programs should use pthreads for concurrency, and each\nthread should be deterministic when run in isolation.\n\nDocumentation\n----------------------\n\nThe main documentation can be found in the git repository at\nhttps://github.com/nidhugg/nidhugg/blob/master/doc/manual.pdf , or in\nthe source at doc/manual.pdf.\n\nLicense\n----------\n\n   Nidhugg is licensed under GPLv3. See COPYING.\n\n   Nidhugg is free software: you can redistribute it and/or modify it\n   under the terms of the GNU General Public License as published by\n   the Free Software Foundation, either version 3 of the License, or\n   (at your option) any later version.\n\n   Nidhugg is distributed in the hope that it will be useful, but\n   WITHOUT ANY WARRANTY; without even the implied warranty of\n   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n   General Public License for more details.\n\n### LLVM License\n\n   Part of the code in the files listed below originate in the LLVM\n   Compiler Framework (http://llvm.org, version 3.4.1). Those parts\n   are licensed under the University of Illinois/NCSA Open Source\n   License as well as under GPLv3. See LLVMLICENSE.TXT.\n\nContact / Bug Report\n------------------------------\n\n   Feedback, questions or bug reports should be reported as issues on\n   [Github](https://github.com/nidhugg/nidhugg).",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [],
  "content_types": []
}