{
  "user": "niemasd",
  "name": "favites",
  "namespace": "niemasd",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "FAVITES - FrAmework for VIral Transmission and Evolution Simulation",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 23761,
  "last_updated": "2022-10-28T18:44:46.983219Z",
  "date_registered": "2017-06-30T20:34:15.965766Z",
  "collaborator_count": 2,
  "affiliation": null,
  "hub_user": "niemasd",
  "has_starred": false,
  "full_description": "**FAVITES** (FrAmework for VIral Transmission and Evolution Simulation) is a robust modular framework for the simultaneous simulation of a transmission network and viral evolution, as well as simulation of sampling imperfections of the transmission network and of the sequencing process ([Moshiri *et al*., 2018](https://doi.org/10.1093/bioinformatics/bty921)). The framework is robust in that the simulation process has been broken down into a series of interactions between abstract module classes, and the user can simply plug in each desired module implementation (or implement one from scratch) to customize any stage of the simulation process.\n\nBecause of the modular nature of FAVITES, a single README would become too convoluted. As a result, all information, including installation information, requirements, usage, file format descriptions, etc., are located in the [FAVITES Wiki](https://github.com/niemasd/FAVITES/wiki).\n\nNote that many FAVITES module implementations wrap around existing tools, so in addition to citing FAVITES, you should cite the tools wrapped in any module implementations you use in your study.\n\n# Citing FAVITES\nIf you use FAVITES in your work, please cite:\n\n> **Moshiri N**, Ragonnet-Cronin M, Wertheim JO, Mirarab S (2018). \"FAVITES: simultaneous simulation of transmission networks, phylogenetic trees, and sequences.\" *Bioinformatics*. 35(11):1852-1861. [doi:10.1093/bioinformatics/bty921](https://doi.org/10.1093/bioinformatics/bty921)\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}