{
  "user": "nodecg",
  "name": "nodecg",
  "namespace": "nodecg",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Create broadcast graphics using Node.js and a browser",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 4,
  "pull_count": 874814,
  "last_updated": "2020-05-12T20:22:17.940372Z",
  "date_registered": "2016-06-11T19:58:38.598755Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "nodecg",
  "has_starred": false,
  "full_description": "# NodeCG\n\n[![NodeCG](https://raw.githubusercontent.com/nodecg/nodecg/master/media/splash.png)](http://nodecg.com/)\n\n[![Discord](https://img.shields.io/discord/423233465643827211.svg?logo=discord)](https://discord.gg/NNmVz4x)\n[![Build Status](https://github.com/nodecg/nodecg/workflows/CI/badge.svg)](https://github.com/nodecg/nodecg/actions?query=workflow%3ACI)\n[![Coverage Status](https://codecov.io/gh/nodecg/nodecg/branch/master/graph/badge.svg)](https://codecov.io/gh/nodecg/nodecg)\n[![Docker Build Status](https://img.shields.io/docker/build/nodecg/nodecg.svg)](https://hub.docker.com/r/nodecg/nodecg/tags/)\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/fold_left.svg?style=social&label=Follow%20%40NodeCG)](https://twitter.com/NodeCG)\n\nNodeCG is a broadcast graphics framework and application. It enables you to write complex, dynamic broadcast graphics\nusing the web platform. NodeCG has no graphics or drawing primitives of its own. Instead, NodeCG provides\na structure for your code and an API to facilitate moving data between the dashboard, the server, and your graphics.\nIt makes no assumptions about how to best code a graphic, and gives you complete freedom to use whatever libraries,\nframeworks, tools, and methodologies you want. As such, NodeCG graphics can be rendered in any environment that\ncan render HTML, including:\n\n- [OBS Studio](https://obsproject.com/)\n- [vMix](http://www.vmix.com/)\n- [XSplit](https://www.xsplit.com/)\n- [CasparCG](https://github.com/CasparCG/server/releases) (v2.2.0+)\n\n> Don't see your preferred streaming software on this list? NodeCG graphics require Chrome 49 or newer. If your streaming software's implementation of browser source uses a build of CEF that is based on at least Chrome 49, chances are that NodeCG graphics will work in it. You can check what version of Chrome your streaming software uses for its browser sources by opening [whatversion.net/chrome](http://www.whatversion.net/chrome) as a browser source.\n\nHave questions about NodeCG, or just want to say 'hi'? [Join our Discord server](https://discord.gg/NNmVz4x)!\n\n## Documentation & API Reference\n\nFull docs and API reference are available at https://nodecg.com\n\n## Goals\n\nThe NodeCG project exists to accomplish the following goals:\n\n- Make broadcast graphics (also known as \"character generation\" or \"CG\") more accessible.\n- Remain as close to the web platform as possible.\n- Support broadcasts of any size and ambition.\n\nLet's unpack what these statements mean:\n\n### > Make broadcast graphics (also known as \"character generation\" or \"CG\") more accessible\n\nHistorically, broadcast graphics have been expensive. They either required expensive hardware, expensive software, or both. NodeCG was originally created to provide real-time broadcast graphics for Tip of the Hats, which is an all-volunteer charity fundraiser that had a budget of \\$0 for its first several years.\n\nNow, it is possible to create an ambitious broadcast using entirely free software and consumer hardware. The NodeCG project embraces this democratization of broadcast technology.\n\n### > Remain as close to the web platform as possible\n\nNodeCG graphics are just webpages. There is absolutely nothing special or unique about them. This is their greatest strength.\n\nBy building on the web platform, and not building too many abstractions on top of it, people developing broadcast graphics with NodeCG have access to the raw potential of the web. New APIs and capabilities are continually being added to the web platform, and NodeCG developers should have access to the entirety of what the web can offer.\n\n### > Support broadcasts of any size and ambition\n\nNodeCG's roots are in small broadcasts with no budget. More recently, NodeCG has begun seeing use in increasingly elaborate productions. We believe that one set of tools can and should be able to scale up from the smallest show all the way to the biggest fathomable show. Whether you're using OBS for everything, or a hardware switcher with a traditional key/fill workflow, NodeCG can be a part of any broadcast graphics system.\n\n## Maintainers\n\n- [Alex \"Lange\" Van Camp](https://alexvan.camp)\n- [Matt \"Bluee\" McNamara](https://mattmcn.com/)\n- [Keiichiro \"Hoishin\" Amemiya](https://hoish.in/)\n\n## Designers\n\n- [Chris Hanel](http://www.chrishanel.com)\n\n## Acknowledgements\n\n- [Atmo](https://github.com/atmosfar), original dashboard concept and code, the inspiration for toth-overlay\n- [Alex \"Lange\" Van Camp](http://alexvan.camp), designer & developer of [toth-overlay](https://github.com/TipoftheHats/toth-overlay), the base on which NodeCG was built\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}