{
  "user": "openpolitics",
  "name": "groupthink",
  "namespace": "openpolitics",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 54,
  "last_updated": "2018-01-07T16:47:27.239003Z",
  "date_registered": "2017-11-06T13:05:10.984686Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "openpolitics",
  "has_starred": false,
  "full_description": "[![Build Status](https://travis-ci.org/openpolitics/groupthink.png?branch=master)](https://travis-ci.org/openpolitics/groupthink) [![Coverage Status](https://coveralls.io/repos/github/openpolitics/groupthink/badge.svg?branch=master)](https://coveralls.io/github/openpolitics/groupthink?branch=master) [![Dependency Status](https://gemnasium.com/badges/github.com/openpolitics/groupthink.svg)](https://gemnasium.com/github.com/openpolitics/groupthink) [![Code Climate](https://codeclimate.com/github/openpolitics/groupthink/badges/gpa.svg)](https://codeclimate.com/github/openpolitics/groupthink)\n\n\n# Groupthink\n\nA collaborative writing platform built on top of GitHub, originally designed for open policymaking and manifesto writing.\n\nIt has two main functions:\n\n1. Provide a friendly interface to make changes (using pull requests) to GitHub-hosted Jekyll websites, using Markdown.\n\n2. Monitor discussion in those pull requests, and layer on a voting system to determine what should be merged in. Voting is done using special symbols in pull requests, which are counted by the app. Status is set using the GitHub commit status API.\n\nThe system was originally implemented for the collaborative manifesto project at https://openpolitics.org.uk/manifesto. The canonical instance of this app for that project is https://votebot.openpolitics.org.uk\n\n## Usage\n\n... to be written ...\n\n### Voting rules\n\n... to be written ...\n\n## Get your own!\n\nIf you want to run your own open democratic platform, you can! This isn't a simple process yet, unfortunately, but we'll help you through as best we can...\n\nNote that currently the style and headers of the deployed app will still match the [OpenPolitics Manifesto version](https://votebot.openpolitics.org.uk). A [change for that](https://github.com/openpolitics/groupthink/issues/42) will be coming soon.\n\n### Set up a GitHub repository for your content\n\nYou can use Groupthink to edit any GitHub repository you like, but we've set up a template site using GitHub Pages and Jekyll to get you started. \n\n[Click here to create your very own copy, ready to go.](https://github.com/openpolitics/template/fork)\n\nThen visit the cloned repository's settings page, and:\n\n* rename it to something more useful than `template`\n* enable GitHub pages on the `master` branch\n\nYour new site will be visible at `https://{{your-username}}.github.io/{{repository-name}}`. If you've set up a CNAME on your user site, the URL will be different, but you're advanced enough to work that out yourself.\n\n### Create a GitHub API token\n\nVisit the [Personal Access Tokens page](https://github.com/settings/tokens) on your GitHub account to create a token for accessing the API. Generate a new token. You'll need to allow the following permissions:\n\n* public_repo\n* repo:status\n* user:email \n* write:repo_hook\n\nKeep hold of the generated token - you'll need it in a minute.\n\n### Create a GitHub OAuth application\n\nVisit the [Developer applications page](https://github.com/settings/developers) on your GitHub account to set up user login via GitHub. Register a new application; in the homepage and callback URLs enter the URL of the application you are about to deploy. Yes, that's slightly tricky. It will be something like `https://your-unique-groupthink-app-name.herokuapp.com`. Make up the `your-unique-groupthink-app-name` part. The name of your project will probably do.\n\nAgain, keep hold of the client ID and secret. You'll need them in the next step.\n\n### Deploy the code to Heroku\n\nHit this big deploy button here: \n\n[![Deploy](https://www.herokucdn.com/deploy/button.svg)](https://heroku.com/deploy)\n\nThen, enter all the relevant details. Use the same app name you did in the step above, `your-unique-groupthink-app-name`. If it's taken, don't worry, you can go back and edit the GitHub application settings later.\n\nEnter the personal access token, client ID, and secret from the previous stage. Enter the repository path of your cloned template site - it should be something like `your-username/repository-name`.\n\n### Set up the GitHub webhook\n\nGo back to the GitHub setting tab for your repository and click on `webhooks`, then `Add a webhook`.\n\nEnter the Payload URL `https://your-unique-groupthink-app-name.herokuapp.com/webhook`, changing the root URL to be the one you're using for your deployed groupthink.\n\nLeave the rest of the settings on default except for \"which events would you like to trigger this webhook?\". Select \"Let me select individual events\" and then choose just:\n\n* Issue comment\n* Pull request\n\nSave the webhook. It will probably complain with the test payload, but should work for the real thing. [We'll fix this soon](https://github.com/openpolitics/groupthink/issues/44). [We might even be able to automate it](https://github.com/openpolitics/groupthink/issues/43).\n\n### Configure the editor link on your site\n\nGo to the `_config.yml` file in your site's GitHub repository, and add the URL of your deployed Heroku app to the `groupthink_url` setting. It will be the same as what you put in above for the GitHub application homepage, i.e. `https://your-unique-groupthink-app-name.herokuapp.com`\n\n### Enable the nightly tasks\n\nVisit the Heroku dashboard for your app, and on the \"Resources\" tab, choose the Heroku Scheduler. Add a new job, `rake nightly`, on a free dyno on a daily schedule. It's probably sensible to run it sometime in the small hours of the morning. \n\nThis task will run the following tasks, in this order:\n\n * `rake merge`: merges any proposals that have been passed\n * `rake close`: closes any proposals that are over the maximum age\n * `rake update`: reloads data from github, counts votes, and performs time checks.\n\nBecause `update` is run last, proposals will be marked as passed or dead, and only closed or merged on the next run of the rake task. If run nightly, this gives 24 hours of grace before automatic actions are taken.\n\n### Enable automatic deployment\n\nIf you want to keep your version of groupthink up to date with the latest changes, visit the Heroku dashboard for your app, and enable automatic deployment on the Deploy tab.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}