{
  "user": "paschmann",
  "name": "rasa-ui",
  "namespace": "paschmann",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "A web UI for RASA NLP & Core to create, manage & test your training data. Rasa NLP/Core not included",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 8,
  "pull_count": 19258,
  "last_updated": "2020-06-21T17:09:47.457722Z",
  "date_registered": "2018-03-13T00:37:31.848829Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "paschmann",
  "has_starred": false,
  "full_description": "[![Docker Automated build](https://img.shields.io/docker/automated/jrottenberg/ffmpeg.svg)](https://hub.docker.com/r/paschmann/rasa-ui/)\n\n# Rasa UI \n\nRasa UI is a web application built on top of, and for [Rasa](https://github.com/RasaHQ/rasa). Rasa UI provides a web application to quickly and easily be able to create and manage bots, NLU components (Regex, Examples, Entities, Intents, etc.) and Core components (Stories, Actions, Responses, etc.) through a web interface. It also provides some convenience features for Rasa, like training and loading your models, monitoring usage or viewing logs.\n\n## Features\n\n- UI for creating and managing training data - Examples, Intents, Entities, Synonyms, Regex, Stories, Actions, Responses\n- Manage multiple bots from a single UI/instance of Rasa UI\n- Create, manage and load different versions of your models for testing and optimizing\n- Log requests for usage tracking, history and improvements to your models\n- Easily execute intent parsing using different models\n- Data is stored in a SQLite DB for backing up/sharing\n- Can be used with or without a Rasa backend to manage your training data\n\n<img src=\"/web/src/assets/img/screenshot1.png\" width=\"500\">\n<img src=\"/web/src/assets/img/screenshot2.png\" width=\"500\">\n\n## Getting Started\n\nRasa UI can run on your Rasa instance, or on a separate machine. Technically Rasa is not required, you could just use the UI for managing training data.\n\n### Prerequisites\n\n[Node.js/npm](https://nodejs.org/en/) - Serves Rasa UI - Required\n\n[Rasa](https://github.com/RasaHQ/rasa) - Developed against Version 1.2+ - Optional\n\n### Installing\n\n1. Clone/download the Rasa UI repository or a [release](https://www.github.com/paschmann/rasa-ui)\n2. Install npm packages.\n3. Set Rasa Server variable in package.json\n\n```\ngit clone https://github.com/paschmann/rasa-ui.git\ncd rasa-ui\nnpm install\n```\n\n## Running\n\nRun npm start from the server folder (rasa-ui)\n\n```\nnpm start\n```\nYour web application should be available on http://localhost:5001\n\n## Running from Docker\n\nIf you **already** have a Rasa instance setup and running, you can run Rasa UI from docker hub using [paschmann/rasa-ui](https://hub.docker.com/r/paschmann/rasa-ui/). You will need to edit the environment variables, specifically the **rasa_endpoint**.\n\nIf you **dont** have a Rasa instance setup, you can run both Rasa and Rasa UI using the [docker-compose file](https://github.com/paschmann/rasa-ui/blob/master/docker-compose.yml), copy the file to a local directory and run the command below:\n\n```\ndocker-compose up\n```\n\nThe docker-compose up command will use the docker-compose.yml file to create both the Rasa container and Rasa UI container, and create a networked connection between both.\n\n## Upgrading\n\nBecause Rasa UI uses a Database to store training data, and other content, in the event the database schema changes, you will need to modify your database when upgrading to newer versions of Rasa UI. Please review the server/db migration folder for upgrade scripts from and to newer versions if you have existing data and want to maintain it. If you are upgrading from Rasa UI prior to v.3.0.0 there is no data migration path as previously postgres was used, and now sqlite is being used.\n\n## Logging\n\nSince Rasa UI can be used to log events/intent parsing/training etc. we would suggest changing your endpoints for your API calls to \"pass through\" Rasa UI. All API requests are simply logged, forwarded to Rasa and then returned.\n\ne.g. Instead of POST'ing to your Rasa instance which is normally something like http://localhost:5005/model/parse?q=hello you can POST to Rasa UI (e.g. http://localhost:5001/api/v2/rasa/model/parse?q=hello)\n\n## Contributing\n\nPlease read [contributing.md](contributing.md) for details on our code of conduct, and the process for submitting pull requests to us.\n\n## Contributers\n\nRasa UI is possible thanks to all the awesome contributers, thank you!\n\n* **Pradeep Mamillapalli**\n* **elvay1**\n* **huberrom**\n* **ClaasBrueggemann**\n* **btran10**\n* **btotharye**\n* **beevelop**\n\n## License\n\nThis project is licensed under the MIT License - see the [license](license) file for details\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}