{
  "user": "ravenscroftj",
  "name": "partridge",
  "namespace": "ravenscroftj",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Machine learning scientific paper indexing service",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 47,
  "last_updated": "2021-10-06T17:13:23.775006Z",
  "date_registered": "2021-01-30T10:11:14.126549Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "ravenscroftj",
  "has_starred": false,
  "full_description": "Partridge\n=================\n\nPartridge is an automated scientific literature retrieval and recommendation suite. \nIt was my dissertation project during 2012-2013 at Aberystwyth University, Wales.\n\nPartridge provides a full pipeline for conversion, annotation and\nclassification of scientific papers. It uses some external tools but also a\nfair amount of novel behaviour during this process. A web interface is also\nprovided so that papers can be indexed and searched. The long term goal is to\nprovide content-based recommendations for users of the system.\n\nPDF Conversion\n----------------\nPartridge uses [PDFX](http://pdfx.cs.man.ac.uk/), a tool provided by Alexander\nConstantin at the University of Manchester, for extracting\n[JATS](http://jats.nlm.nih.gov/archiving/) compatible XML for processing and\nannotation. \n\nScientific Concept Annotation\n------------------------------\nPartridge makes use of [SAPIENTA](http://sapientaproject.com/), a machine\nlearning classifier written by Maria Liakata et al., to annotate the scientific\nconcepts within papers sentence-by-sentence. This allows a deeper understanding\nof the structure of the papers and is also used for paper type classification.\n\nPaper Type Classification\n---------------------------\nPaper type classification is novel behaviour within Partridge. A Random Forest\nclassifier has been trained to recognise types of paper (Research Article,\nReview, Case Study etc.) based on a paper's scientific concept annotations.\n\n\nInstalling Partridge\n=======================\n\nIf you want to use Partridge to find a paper, you don't need to download and install\nthis package. There is an instance running at http://farnsworth.papro.org.uk/\n\nThe following instructions are for those interested in setting up their own instance of Partridge\nor for modifying my code.\n\nSystem Requirements\n-------------------------\n  * Partridge requires Python 2.7.3 and an SQL database backend supported by SQLAlchemy. \n  * Partridge *should* be cross platform, but hasn't been fully tested on MacOSX or Windows.\n  * SQLite3 comes with Python by default, but is not recommended for large scale Partridge installations.\n  * Partridge was developed on an Arch Linux desktop computer with Python 2.7.3 and MySQL backend server.\n  * http://farnsworth.papro.org.uk/ is a CentOS 6 box with Python 2.7.3 and MySQL backend.\n\nInstallation\n-------------------------\n\n### VirtualEnv ###\n\nIt is recommended that you install Partridge into a [VirtualEnv](http://www.virtualenv.org/en/latest/) \nenvironment on your system rather than adding it to your system-wide Python installation. If you aren't \nfamiliar with VirtualEnv, it is essentially a way of sandboxing Partridge's run environment from your \nsystem-wide python installation, preventing problems with module dependencies and security issues.\n\n### Dependencies ###\n\n#### SAPIENTA ####\n\nSAPIENTA is currently also a dependency of Partridge. You can get it from [here](https://bitbucket.org/partridge/sapienta/).\n\nYou need to make sure you install SAPIENTA and Partridge in the same virtualenv.\n\n#### Library/System dependencies ####\n\nPartridge was written and runs on Ubuntu. It is suggested that you install it on a unix/linux system that is similar to Ubuntu. It will run happily on OS/X but some of the commands here will not work.\n\nPartridge requires the *libmysqlclient-dev*  package installed so that it can run with a MySQL database (or you can use SQLite or whatever other database you want). \n\nPartridge was written in and runs in *python2* so it probably won't work in Python 3 at the moment.\n\n#### Python dependencies ####\n\nPartridge has several dependencies that it requires to run successfully. These are:\n\n  * [Flask](http://flask.pocoo.org/) \n  * [Flask-SQLAlchemy](http://pythonhosted.org/Flask-SQLAlchemy/)\n  * [pycurl](http://pycurl.sourceforge.net/)\n  * [NLTK](http://nltk.org/)\n  * [python-progressbar](https://pypi.python.org/pypi/progressbar/2.2)\n  * [pyinotify](https://github.com/seb-m/pyinotify)\n  * [Alembic](https://bitbucket.org/zzzeek/alembic)\n  * [Orange](http://orange.biolab.si/)\n\n**Please note: You will need to make sure that the relevant database backend is installed for SQLAlchemy \nto be able to communicate with your database. This is not done automatically. Python was built and tested \nwith MySQL. However, there is a full list of supported \n[SQL dialects and respective libraries here](http://docs.sqlalchemy.org/en/rel_0_8/dialects/).**\n\nPartridge has a distutils boostrap script that will try and install these libraries (and their respective \ndependencies) when you build the system. However, it will compile them from source which is a slow process. \nIf you have the option to install binary packages for Orange and NLTK, it is worth doing this beforehand.\n\n### Typical Installation Workflow ###\n\nFirst, check out the repository from GIT.\n\n    $ git clone https://github.com/ravenscroftj/partridge.git\n    Cloning into 'partridge'...\n\nSet up the virtual environment and run the source command to start using the new environment.\n\n    $ cd partridge\n    $ virtualenv env\n    New python executable in env/bin/python2\n    Also creating executable in env/bin/python\n    Installing setuptools............done.\n    Installing pip...............done.\n    $ source env/bin/activate\n\nA little (env) should appear indicating that you have entered the virtual environment. Now install your database driver\nusing pip. For a Partridge installation that will use [MySQL](http://www.mysql.com/), run the following command. If you intend to use\na different RDBMS, you should replace `mysql-python` with the relevant library listed [here](http://docs.sqlalchemy.org/en/rel_0_8/dialects/).\n\n    (env) $ pip install mysql-python\n    Downloading/unpacking mysql-python\n    ...\n    ...\n    \nNext you will need to clone and install SAPIENTA (inside the partridge directory).\n\n    (env) $ git clone git@bitbucket.org:partridge/sapienta.git\n    Cloning into 'sapienta'\n    ...\n    ...\n\nYou should follow the guide to install SAPIENTA and ensure that you use the same python virtualenv for both systems.\n\nFinally, you can build the Partridge subsystem and dependencies with the following command.\n\n    (env) $ python setup.py install\n    running install\n    running bdist_egg\n    running egg_info\n    ...\n    ...\n\n#### Installing paper types model.\n\nCreate a directory inside your partridge project dir called \"models\" and download the pre-built decision tree model into it from [here](https://www.dropbox.com/s/lrgx6y7j9m82w0o/paper_types.model?dl=0).\n\n\n### Configuration\n\nPartridge uses a simple configuration file called `partridge.cfg`. The program will look for the existence of such a file at runtime\nin the following locations:\n\n  1. If you specify `-c filename.cfg` when running Partridge, it will try to use the provided filename first.\n  2. If `-c` is not set, it will check for the existence of a `PARTRIDGE_CONF` variable set by your terminal environment\n  3. If no environment variable is set, it will look in the current working directory for a `partridge.cfg` file.\n  4. If no file could be found in the current working directory, it will try looking in `/home/yourname/.config/` for a config file.\n  5. If no file was found in your home dir, the system will try /etc/partridge.cfg for a systemwide configuration file.\n\nSetting up your configuration file is simple, rename the provided sample (`partridge.cfg.sample`) and place it in the appropriate directory. \nThe below table illustrates each option and what it does\n\n<table>\n\t<tr>\n\t\t<th><b>Variable Name</b></th>\n\t\t<th><b>Description</b></th>\n\t</tr>\n\t<tr>\n\t\t<td>`DEBUG`</td>\n\t\t<td>If set to True, puts Flask and Partridge into debug mode and maximises log verbosity levels. Legal values: True, False\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>`SQLALCHEMY_DATABASE_URI`</td>\n\t\t<td>This is a connection string passed straight to SQLAlchemy in order to connect to your backend. SQLAlchemy provide\n\t\t     documentation on how to form a connection string for your preferred database backend \n                     [here](http://docs.sqlalchemy.org/en/rel_0_8/core/engines.html#database-urls). Example connection strings for SQLite and\n\t\t     MySQL are provided in the sample config file.\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>`PAPER_UPLOAD_DIR`</td>\n\t\t<td>This is the directory that papers are uploaded to when they are queued to be processed. This is usually a subdirectory\n\t\tof the Partridge environment that you installed using the instructions above.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`PAPER_PROC_DIR`</td>\n\t\t<td>Similar to the above, this is the path to the directory where processed files are stored. Again, usually within the \n\t\tPartridge environment.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`MODELS_DIR`</td>\n\t\t<td>This is the path of the models directory which is where Partridge stores its machine learning classifier models. This\n\t\tis the absolute path to the `models` directory just inside Partridge's top level directory.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`SERVER_NAME`</td>\n\t\t<td>(Optional) This variable is set if your server has multiple domain/host names (because it is a virtual private server or \n\t\thosts a number of separate websites. This is just a hostname value such as \"farnsworth.papro.org.uk\" that Partridge should \n\t\tlisten for requests on.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`NOTIFICATION_SMTP_ADDRESS`</td>\n\t\t<td>(Optional) If you wish to be notified every time a paper fails (this is *as well as* letting the paper submitter know that it \t\t\tfailed), then enter an email address to send these notifications to here.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`NOTIFICATION_SMTP_SERVER`</td>\n\t\t<td>(Optional) If you wish to send out email notifications, this is the address of the SMTP server to send notifications from.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`NOTIFICATION_SMTP_USER`</td>\n\t\t<td>(Optional) If your SMTP server requires authentication, this is the username to authenticate with.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`NOTIFICATION_SMTP_PASWD`</td>\n\t\t<td>(Optional) If your SMTP server requires authentication, this is the password to authenticate with.</td>\n\t</tr>\n\t<tr>\n\t\t<td>`NOTIFICATION_SMTP_FROM`</td>\n\t\t<td>(Optional) This is the email address that notifications claim to have been sent from. It can be distinct\n\t\tfrom your `NOTIFICATION_SMTP_USER` value.</td>\n\t</tr>\n</table>\n\n### Installing the database ###\nOnce you have set up your relational database backend, configured the SQLAlchemy connection string as detailed above \nand created an empty database for Partridge's data to go into, you can initialise the schema and start the server \nwith the following command:\n\n    (env) $ partridged --initdb\n\n\nRunning Partridge\n---------------------\n\nRunning Partridge as a standalone server is very simple provided you have successfully installed and configured\nthe system as detailed in the previous sections of this document, you can run Partridge using\n\n    (env) $ partridged\n\nThere are several commands that can be specified at runtime through the use of commandline arguments. Use `partridged --help` \nfor more information.\n\nUsing Partridge with WSGI\n--------------------------\n\n### Configuring WSGI ###\n\nIf you want to run Partridge in a WSGI environment, you will need to [configure WSGI](http://wsgi.readthedocs.org/en/latest/) \nto use the `partridge.wsgi` file as an entrypoint. You'll want to update the paths in `partridge.wsgi` to point to the right\nfolders and directories on your installation path.\n\n### Paper Daemon ###\n\nThere was no easy way for me to make the paper preprocessor daemon run as part of the WSGI service, so you still need to run \nthe paper daemon as a separate process. Running `partridged --paperdaemon` will start the Partridge standalone server without the\nweb frontend, and provided that it shares the same `partridge.cfg` file as the WSGI setup, will handle papers uploaded through the \nWSGI interface automatically.\n\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}