{
  "user": "rijdendetreinen",
  "name": "gotrain",
  "namespace": "rijdendetreinen",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "GoTrain",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 1,
  "pull_count": 78,
  "last_updated": "2022-08-24T21:22:46.61683Z",
  "date_registered": "2021-07-24T14:25:59.719398Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "geertw",
  "has_starred": false,
  "full_description": "GoTrain\n=======\n\nGoTrain is a server application for receiving, processing and distributing\nreal-time data about train services in the Netherlands. GoTrain is developed by [Rijden de Treinen](https://www.rijdendetreinen.nl/).\n\nGoTrain is designed to continuously receive data streams offered as open data\nby the [Dutch Railways (NS)](http://www.ns.nl/). The data is processed and\nsaved in-memory in order to offer a very fast REST API, which can be used by\nnumerous clients to show live information about train departures, arrivals etc.\n\nYou can find the full source code and all docs on the [GoTrain GitHub page](https://github.com/rijdendetreinen/gotrain).\n\nGoTrain is currently able to process the following data streams:\n\n* Arrivals (arriving service at a station)\n* Departures (departing service from a station)\n* Services (data about a complete trip for a single train)\n\nAnd it offers the received data through a number of REST APIs, which allow you\nto:\n\n* Request a summary of all departing trains for a single station\n* Detailed information for a departing train\n* All upcoming arrivals for a single station\n* Detailed information about a single train journey\n\nYou can also use GoTrain to store all services to a Redis queue for further\nprocessing (archive function).\n\nIt is easy to extend GoTrain's functionality or to build your own applications\nusing the REST API. For example: create your live departures board, or analyze\nwhich trains are currently delayed or cancelled on the Dutch rail network.\n\n\nLicense\n-------\n\nCopyright (c) 2019-2021 Geert Wirken, Rijden de Treinen\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}