{
  "user": "ryankurte",
  "name": "docker-rpi-emu",
  "namespace": "ryankurte",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "Qemu based emulation for raspberry pi using loopback images",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 20,
  "pull_count": 3143,
  "last_updated": "2020-10-28T02:49:00.955495Z",
  "date_registered": "2016-06-08T04:18:45.485716Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "ryankurte",
  "has_starred": false,
  "full_description": "# Docker emulation environment for Raspberry Pi\n\nAre you sick of long compile times on your Raspberry Pi?  \nHow much time have you spent loading Raspbian images from raspberrypi.org and hand customising them?  \nDo you too wish you could run Raspberry Pi apps in a docker container against a persistant .img file inside xhyve on macOS?\nThen this is the project for you!  \n\nThis project provides a dockerised (err, containerised) Qemu based emulated environment for the Raspberry Pi, useful for building Raspberry Pi based projects on x64 computers, and for customising Raspbian images for distribution.  \n\nPlease note that this is very new. It works pretty well uner linux and OSX for emulation and for creating images to deploy, but YMMV.  \nIt's also not a very good docker container, requiring priveledged mode to mount loopback adaptors and qemu on the docker host. All the scripts here can be run on native linux if you're that way inclined.\n\nCheck it out on [Github](https://github.com/ryankurte/docker-rpi-emu/) or [Dockerhub](https://hub.docker.com/r/ryankurte/docker-rpi-emu/)  \n\n![Example](https://raw.github.com/ryankurte/docker-rpi-emu/gh_pages/screenshots/02.png)\n\n## Usage\n\nNote that your docker host machine must have qemu installed. Using Docker for Mac the host environment includes this as standard (OSX docker-machines however do not come with qemu), in Debian you will need to install the qemu and qemu-user-static packages.  \n\n### From the Repo\n\nTo get started with an Emulated CLI:\n\n1. Run `git clone git@github.com:ryankurte/docker-rpi-emu.git` check out this repository\n2. Run `cd docker-rpi-emu` to change into the directory\n3. Run `make run-emu` to launch the emulated environment\n\nThis will bootstrap a Raspbian image from raspberrypi.org, build the docker image, and launch the emulated environment.  \n\nFor examples of how to customise this, checkout the [Makefile](Makefile).  \n\n### From Dockerhub\n\nTo get started with Docker, first pull the image with `docker pull ryankurte/docker-rpi-emu`.  \n\nEnsure you have a Raspbian image handy (and you may want to back this up, it will be modified by anything you do in the emulated environment), then run the following command.  \n\n`docker run -it --rm --privileged=true -v IMAGE_LOCATION:/usr/rpi/images -w /usr/rpi ryankurte/docker-rpi-emu /bin/bash -c './run.sh images/IMAGE_NAME [COMMAND]'`  \n\nWhere IMAGE_LOCATION is the directory containing your Raspbian image to be mounted, IMAGE_NAME is the name of the image to be used, and [COMMAND] is the optional command to be executed (inside the image).  \n\nFor example:  \n\n`docker run -it --rm --privileged=true -v /Users/ryan/projects/docker-rpi-emu/images:/usr/rpi/images -w /usr/rpi ryankurte/docker-rpi-emu /bin/bash -c './run.sh images/2016-05-27-raspbian-jessie-lite.img /bin/bash'`  \n\nWill mount the image directory `/Users/ryan/projects/docker-rpi-emu/images` and the image `2016-05-27-raspbian-jessie-lite.img` then run the command `/bin/bash` in the emulated environment.  \n\n\n## Components\n\nThe docker container includes the required Qemu components to support emulation. This must be launched in privileged mode to allow mounting of loopback devices.  \n\nThe container also includes a set of scripts to streamline the loading/customization/launch/unloading of Qemu environments, which are installed into the `/usr/rpi` directory on the device.  \n\n\n## Commands\n\nCommands are installed into the `/usr/rpi` directory of the docker image.  \n\n`./mount.sh IMAGE DIR` identifies the partition sizes in the image and mounts the raspbian image to the location specified by DIR (both root and boot partitions).  \n`./unmount.sh DIR` unmounts both partitions mounted to DIR using the above script.  \n`./qemu-setup.sh DIR` adds Qemu components to the image at the mount point specified by DIR.  \n`./qemu-cleanup.sh DIR` removes Qemu components from the image at the mount point specified by DIR.  \n`./qemu-launch.sh DIR` runs Qemu instance from the directory specified by DIR  \n`./run.sh IMAGE [COMMAND]` wires all the above commands together to simplify launching an emulated environment with the provided IMAGE and optional COMMAND to execute.\n\nIf you have any questions, comments, or suggestions, feel free to open an issue or a pull request.  \n\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}