{
  "user": "smirarab",
  "name": "pasta",
  "namespace": "smirarab",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": " PASTA: Practical Alignment using Sate and TrAnsitivity",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 523,
  "last_updated": "2021-07-03T03:38:48.729973Z",
  "date_registered": "2018-04-16T16:08:00.676498Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "smirarab",
  "has_starred": false,
  "full_description": "This is an implementation of the PASTA (Practical Alignment using Saté and TrAnsitivity) algorithm published in [RECOMB-2014](http://link.springer.com/chapter/10.1007%2F978-3-319-05269-4_15#) and JCB:\n\n* Mirarab S, Nguyen N, Warnow T. PASTA: ultra-large multiple sequence alignment. Sharan R, ed. Res Comput Mol Biol. 2014:177-191.\n* Mirarab S, Nguyen N, Guo S, Wang L-S, Kim J, Warnow T. PASTA: Ultra-Large Multiple Sequence Alignment for Nucleotide and Amino-Acid Sequences. J Comput Biol. 2015;22(5):377-386. [doi:10.1089/cmb.2014.0156](http://online.liebertpub.com/doi/abs/10.1089/cmb.2014.0156).\n\nThe latest version includes a new decomposition technique described here:\n\n* Balaban, Metin, Niema Moshiri, Uyen Mai, and Siavash Mirarab. “TreeCluster : Clustering Biological Sequences Using Phylogenetic Trees.” BioRxiv, 2019, 591388. doi:10.1101/591388.\n\n#### Contact: \nAll questions and inquires should be addressed to our user email group: `pasta-users@googlegroups.com`. Please check our [Tutorial](pasta-doc/pasta-tutorial.md) and [previous posts](https://groups.google.com/forum/#!forum/pasta-users) before sending new requests.\n\n#### Developers\n\n* The code and the algorithm are developed by Siavash Mirarab and Tandy Warnow, with help from Nam Nguyen. The latest version of the code includes a new code decomposition designed and implemented by [Uyen Mai](https://github.com/uym2). \n\n\n* The current PASTA code is heavily based on the [SATé code](http://phylo.bio.ku.edu/software/sate/sate.html) developed by Mark Holder's group at KU. Refer to sate-doc directory for documentation of the SATé code, including the list of authors, license, etc. \n* [Niema Moshiri](https://github.com/niemasd) has contributed to the import to dendropy 4 and python 3 and to the Docker image. \n\n**Documentation**: In addition to this README file, you can consult our [Tutorial](pasta-doc/pasta-tutorial.md).\n\nINSTALLATION\n===\n\nYou have four options for installing PASTA. \n\n - **Windows:** If you have a Windows machine, currently using the Docker image or the Virtual Machine (VM) image we provide is your only option. Among those two options, Docker is the preferred method. \n - **Linux:** If you have Linux (or other \\*nix systems), you can still use Docker or VM, but downloading the code from github and installing it is what we recommend. \n - **MAC:** We have four options for MAC: VM, Docker, installing from the code, and downloading the .dmg file. If you mostly use the GUI, then the MAC .dmg file is a good option (although sometimes it can be behind the latest code). Otherwise, we reocmmend either Docker or the code. \n\n\n### 1. From pre-build MAC image file\n\n\n1. Download the MAC application `.dmg` file from [here](https://sites.google.com/eng.ucsd.edu/datasets/alignment/pastaupp). Use the lastest version available\n\n2. Open the .dmg file and copy its content to your preferred destination (do not run PASTA from the image itself).\n3. Simply run the PASTA app from where you copied it.\n\n\nIf the APP does not work, let us know. We will try to fix issues. \nBut you can also try first\n    installing PASTA from the source code (see below) and then run \n    `./make-app.sh` from the pasta directory. This will create an app under\n    `dist` directory, which you should be able to run and copy to any other location. \n\n\n### 2. From Source Code\nThe current version of PASTA has been developed and tested entirely on Linux and MAC. \nWindows won't work currently (future versions may or may not support Windows). \n\nYou need to have:\n\n- [Python](https://www.python.org) (version 2.7 or later, including python 3)\n- [Dendropy](http://packages.python.org/DendroPy/) (but the setup script should automatically install dendropy for you if you don't have it)  \n- [Java](https://www.java.com) (only required for using OPAL)\n- [wxPython](http://www.wxpython.org/) - only required if you want to use the GUI. The setup script does not automatically install this. \n\n**Installation steps**:\n\n1. Open a terminal and create a directory where you want to keep PASTA and  go to this directory. For example:\n\n   ```bash \n   mkdir ~/pasta-code\n   cd ~/pasta-code`\n   ```\n\n2. Clone the PASTA code repository from our [github repository](https://github.com/smirarab/pasta). For example you can use: \n\n   ```bash\n   git clone https://github.com/smirarab/pasta.git\n   ```\n   \n   If you don't have git, you can directly download a [zip file from the repository](https://github.com/smirarab/pasta/archive/master.zip)\nand decompress it into your desired directory. \n\n3.  A. Clone the relevant \"tools\" directory (these are also forked from the SATé project).\nThere are different repositories for [linux](https://github.com/smirarab/sate-tools-linux) \nand [MAC](https://github.com/smirarab/sate-tools-mac).\nYou can use \n\n\t```bash\n\tgit clone https://github.com/smirarab/sate-tools-linux.git #for Linux\n\t``` \n\tor\n\t\n\t```bash\n\tgit clone https://github.com/smirarab/sate-tools-mac.git. #for MAC\n\t``` \n\tOr you can directly download these as zip files for \n[Linux](https://github.com/smirarab/sate-tools-linux/archive/master.zip) or [MAC](https://github.com/smirarab/sate-tools-mac/archive/master.zip)\nand decompress them in your target directory (e.g. `pasta-code`).\n\t* Note that the tools directory and the PASTA code directory should be under the same parent directory. \n\t* When you use the zip files instead of using `git`, after decompressing the zip file you may get a directory called `sate-tools-mac-master` or `sate-tools-linux-master` instead of `sate-tools-mac` or `sate-tools-linux`. \nYou need to rename these directories and remove the `-master` part.\n\t* Those with 32-bit Linux machines need to be aware that the master branch has 64-bit binaries. 32-bit binaries are provided in the `32bit` branch of `sate-tools-linux` git project (so download [this zip file](https://github.com/smirarab/sate-tools-linux/archive/32bit.zip) instead). \n\n3. B. (Optional) Only if you want to use MAFFT-Homologs within PASTA:\n`cd sate-tools-linux` or `cd sate-tools-mac`\nUse `git clone https://github.com/koditaraszka/pasta-databases` or download directly at `https://github.com/koditaraszka/pasta-databases.git`\n\t* Be sure to leave this directory `cd ..` before starting the next step\n\n4. `cd pasta` (or `cd pasta-master` if you used the zip file instead of clonning the git repository)\n\n5. Then run:\n\n\t``` bash\n\t sudo python setup.py develop \n\t```\n \n\tIf you don't have root access, use:\n\t\n\t``` bash\n\tpython setup.py develop  --user\n\t```\n\n\t**Common Problems:**\n\t\n\t * `Could not find SATé tools bundle directory`: this means you don't have the right tools directory at the right location. Maybe you downloaded MAC instead of Linux? Or, maybe you didn't put the directory in the parent directory of where pasta code is? Most likely, you used the zip files and forgot to remove teh `-master` from the directory name. Run `mv sate-tools-mac-master sate-tools-mac` on MAC or `mv sate-tools-linux-master sate-tools-linux` to fix this issue. \n\t * The `setup.py` script is supposed to install setuptools for you if you don't have it. This sometimes works and sometimes doesn't. If you get an error with a message like ` invalid command 'develop'`, it means that setuptools is not installed. To solve this issue, you can manually install [setup tools](https://pypi.python.org/pypi/setuptools#installation-instructions). For example, on Linux, you can run `curl https://bootstrap.pypa.io/ez_setup.py -o - | sudo python` \n\t(but note there are other ways of installing setuptools as well).\n\n6. Pasta now includes additional aligners for Linux and MAC users: mafft-ginsi, mafft-homologs, contralign (version 1), and probcons. In order to use mafft-homologs and contralign, the user must set the environment variable `CONTRALIGN_DIR=/dir/to/sate-tools-linux`. You can use `export CONTRALIGN_DIR=/dir/to/sate-tools-linux` or just edit `~/.bashrc` to have `CONTRALIGN_DIR=dir/to/sate-tools-linux`.\n\t* To use these aligners, add the following to your pasta execution `--aligner=NAME_OF_ALIGNER`, where` NAME_OF_ALIGNER` now includes (`ginsi`, `homologs`, `contralign`, and `probcons`)\n\n### 3. From Docker\n\n1. Make sure you have Docker installed \n\n2. Run\n\n    ~~~bash\n    docker pull smirarab/pasta\n    ~~~\n    \nYou are done. You can test using \n\n~~~bash\n docker run smirarab/pasta run_pasta.py -h\n~~~\n\n### 4. From Virtual Machine (VM)\n\nVM Image (mostly for Windows users) is available for [download](https://drive.google.com/file/d/0B0lcoFFOYQf8U2NZV2Z2RmRaRjQ/view?usp=sharing) (~3 GB). Once the image is downloaded, you need to run it using a VM environment ([VirtualBox](https://www.virtualbox.org/) is a good option). After you install VirtualBox, you just need to use File/import to import the *.ova image that you have downloaded (if your machine has less than 3GB you might want to reduce the memory to something like 512MB). Once VM is imported, you can start it from the Virtualbox. If you are asked to login, the username and passwords are (username: phylolab, password: phylolab). PASTA is already installed on the VM machine, so you can simply proceed by opening a terminal and running it. VM version may be an older version.\n \n- **Note:** the VM is not maintained anymore and so is using an old version of PASTA. \n\n\n\n\n**Email** `pasta-users@googlegroups.com` for installation issues. \n\n\n\nEXECUTION\n====\nTo run PASTA using the command-line:\n\n```bash\npython run_pasta.py -i input_fasta [-t starting_tree] \n```\n\n\nPASTA by default picks the appropriate configurations automatically for you. \nThe starting tree is optional. If not provided, PASTA estimates a starting tree. \n\nRun\n\n```bash\npython run_pasta.py --help\n``` \n\nto see PASTA's various options and descriptions of how they work. \n\nTo run the GUI version, \n\n* if you have used the MAC .dmg file, you can simply click on your application file to run PASTA. \n* if you have installed from the source code, cd into your installation directory and run \n\n```bash\npython run_pasta_gui.py\n```\n\non some machines  you may instead need to use \n\n```bash\npythonw run_pasta_gui.py\n``` \n\nTo run PASTA using Docker, run\n\n```bash\ndocker run -v [path to the directory with your input files]:/data smirarab/pasta run_pasta.py -i input_fasta [-t starting_tree] \n```\n\nOn Windows, you may have to enable drive sharing; see [Shared Drives on this page](https://docs.docker.com/docker-for-windows/).\n\n\nOptions\n------\nPASTA estimates alignments and maximum likelihood (ML) trees from unaligned sequences using an iterative approach. In each iteration, \nit first estimates a multiple sequence alignment and then a ML tree is estimated on (a masked version of) the alignment. \nBy default PASTA performs 3 iterations, but a host of options enable changing that behavior. \nIn each iteration, a divide-and-conquer strategy is used for estimating the alignment. \nThe set of sequences is divided into smaller subsets, each of which is aligned using an external\nalignment tool (the default is MAFFT-L-ins-i). These subset alignments are then pairwise merged (by default using Opal)\nand finally the pairwise merged alignments are merged into a final alignment using transitivity merge. The division\nof the dataset into smaller subsets and selecting which alignments should be pairwise merged is guided by the tree\nfrom the previous iteration. The first step therefore needs an initial tree. \n\nWhen GUI is used, a limited set of important options can be adjusted.\nThe command line also allows you to alter the behavior of the algorithm,\nand provides a larger sets of options that can be adjusted.\n\nOptions can also be passed in as configuration files with the format:\n\n```\n[commandline]\noption-name = value\n\n[sate]\noption-name = value\n```\n\nWith every run, PASTA saves the configuration file for that run as a temporary\nfile called ``[jobname]_temp_pasta_config.txt`` in your output directory.\n\nMultiple configuration files can be provided. Configuration files are read in \nthe order they occur as arguments (with values in later files replacing previously \nread values). Options specified in the command line are read last. Thus, these values\n\"overwrite\" any settings from the configuration files. \n\n*Note*: the use of --auto option can overwrite some of the other options provided by\ncommandline or through configuration files. \nThe use of this option is generally not suggested (it is a legacy option from SATé).\n\n\nThe following is a list of important options used by PASTA. \nNote that by default PASTA picks these parameters for you, and thus you might not need to ever change these:\n\n   * Initial tree: \n     If a starting tree is provided using the `-t` option, then that tree is used.\n     If the input sequence file is already aligned and `--aligned` option is provided, then PASTA computes an ML tree on the input alignment and uses that as the starting tree. \n     If the input sequences are not aligned (or if they are aligned and `--aligned` is not given), PASTA uses the procedure described below for estimating the starting alignment and tree.\n\t1. randomly selects a subset of 100 sequences.\n\t2. estimates an alignment on the subset using the subset alignment tool (default MAFFT-l-insi).\n\t3. builds a HMMER model on this \"backbone\" alignment.\n\t4. uses hmmalign to align the remaining sequences into the backbone alignment. \n\t5. runs FastTree on the alignment obtained in the previous step.\n\n   * Data type: PASTA does not automatically detect your data type. Unless your data is DNA, you need to set the data type using `-d` command. \n   \n   * Subset alignment tool: the default is MAFFT, but you can change it using `--aligner` command.\n   \n   * Pairwise merge tool: the default is OPAL for dna and Muscle for protein. Change it using `--merger` command. \n  \n   * Tree estimation tool: the default is FastTree. You can also set it to RAxML using `--tree-estimator` option. \n     Be aware that RAxML takes much longer than FastTree. \n     If you really want to have a RAxML tree, we suggest obtaining one by running it on the final PASTA alignment. \n     You can change the model used by FastTree (default: -gtr -gammaq for nt and -wag -gamma for aa) \n     or RAxML (default GTRGAMMA for nt and PROTWAGCAT for AA) by updating the `[model]` parameter under `[FastTree]` or `[RAxML]` header in the config file.\n     The model cannot be currently updated in the command line.\n\n   * Number of iterations: the simplest option that can be used to set the number of iterations is `--iter-limit`. \n    You can also set a time limit using `--time-limit`, in which case, PASTA runs until the time limit is reached,\n    then continues to run until the current iteration is finished, and then stops. \n    If both values are set, PASTA stops after the first limit is reached. \n    The remaining options for setting iteration limits are legacies of SATé and are not recommended. \n   \n   * Masking: Since PASTA produces very gappy alignments, it is a good idea to remove sites that are almost exclusively gaps before running the ML tree estimation. \n     By default, PASTA removes sites that are more than 99.9% gaps. \n     You can change that using the `--mask-gappy-sites` option.\n   \n   * Maximum subset size: two options are provided to set the maximum subset size: `--max-subproblem-frac` and `--max-subproblem-size`. \n     The `--max-subproblem-frac` option is a number between 0 and 1 and sets the maximum subset size as a fraction of the entire dataset.\n     The `--max-subproblem-size` option sets the maximum size as an absolute number.\n     When both numbers are provided (in either configuration file or the command line), the *LARGER* number is used. \n     This is an unfortunate design (legacy of SATé) and can be quite confusing. \n     Please always double check the actual subset size reported by PASTA and make sure it is the value intended.\n\n   * Temporary files: PASTA creates many temporary files, and deletes most at the end.\n      You can control the behavior of temporary files using `--temporaries` (to set the tempdirectory),\n    `-k` (to keep temporaries) and `--keepalignmenttemps` (to keep even more temporaries) options. \n    Note that PASTA also creates a bunch of temporary files in the output directory and never deletes them, \n    because these temporary files are potentially useful for the users. These files are all of the form\n    `[jobname]_temp_*`. Some of the important files created are alignments and trees produced in individual \n    steps (alignments are saved both in masked and unmasked versions). These intermediate files all have \n    internal PASTA sequence names, which are slightly different from your actual sequence names.\n    The mapping between PASTA and real names are given also as a temporary file: `[jobname]_temp_name_translation.txt`.\n\n   * Dry run: The `--exportconfig` option can be used to crate a config file that can be checked for \n     correctness before running the actual job. \n\n   * CPUs: PASTA tries to use all the available cpus by default. You can use  `num_cpus` to adjust the number of threads used. \n\n\nThe remaining options available in PASTA are mostly legacies from SATé and are generally not useful for PASTA runs. \n\nOutput\n-------\nPASTA outputs an alignment and a tree, in addition to a host of other files. These various output files are described in more detail in our [tutorial](pasta-doc/pasta-tutorial.md#step-2-inspecting-the-output-of-pasta). Note that the support values on the PASTA output tree are local SH-like support values computed by FastTree, and not bootstrap support values. To get a more reliable measure of support, please use the bootstrapping procedure, applied to the final PASTA alignments (you can use RAxML for this purpose). \n\nDebug\n-------\nTo show debugging information, set the following environmental variables: \n```\nexport PASTA_DEBUG=TRUE\nexport PASTA_LOGGING_LEVEL=DEBUG\nexport PASTA_LOGGING_FORMAT=RICH\n```\n(last line is optional)\n\nLICENSE\n===\nPASTA uses the same [license](LICENSE) as SATé (GNU General Public License).\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}