{
  "user": "spacedeck",
  "name": "spacedeck-open",
  "namespace": "spacedeck",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "spacedeck open source version",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 1,
  "pull_count": 110924,
  "last_updated": "2018-03-30T21:35:50.940761Z",
  "date_registered": "2017-04-07T08:52:16.395481Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "spacedeck",
  "has_starred": false,
  "full_description": "# Spacedeck Open\n\nThis is the free and open source version of Spacedeck, a web based, real time, collaborative whiteboard application with rich media support. Spacedeck was developed in 6 major releases during Autumn 2011 until the end of 2016 and was originally a commercial SaaS. The developers were Lukas F. Hartmann (mntmn) and Martin Güther (magegu).\n\nThe spacedeck.com online service was shut down on May 1st 2018. We decided to open-source Spacedeck to allow educational and other organizations who currently rely on Spacedeck to migrate to a self-hosted or local version.\n\nWe appreciate filed issues, pull requests and general discussion.\n\n**Windows users:** Try the one-click release at https://github.com/spacedeck/spacedeck-open/releases/tag/v0.9\n\nDesktop releases for Linux and Mac will be published here soon. In the meantime, you have to install Node.JS to run Spacedeck.\n\n# Features\n\n- Create virtual whiteboards called *Spaces* with virtually unlimited size\n- Drag & drop images, videos and audio from your computer or the web\n- Write and format text with full control over fonts, colors and style\n- Draw, annotate and highlight with included graphical shapes\n- Turn your Space into a zooming presentation\n- Collaborate and chat in realtime with teammates, students or friends\n- Share Spaces on the web or via email\n- Export your work as printable PDF or ZIP\n\n# Data Import from Spacedeck.com\n\nSpacedeck Open has a data import feature that you can use to migrate your ZIP export from Spacedeck.com.\n\n1. Just copy your downloaded ZIP file into the spacedeck root folder. Don't extract it.\n2. Start your local Spacedeck.\n3. Navigate to *Account / Profile* (person icon in the top right corner).\n4. Click the *Import* button next to the ZIP file name. It is on the bottom of the page.\n5. Wait until console output has finished and you're done.\n\n# Requirements, Installation\n\nSpacedeck requires:\n\n- Node.js 9.x: Web Server / API. Download: https://nodejs.org\n\nTo run Spacedeck, you only need Node.JS 9.x.\n\nTo install all node dependencies, run (do this once):\n\n    npm install\n\n# Configuration\n\nSee [config/default.json](config/default.json)\n\n# Run (web server)\n\n    node spacedeck.js\n\nThen open http://localhost:9666 in a web browser.\n\n# Run (desktop app with integrated web server)\n\n    electron .\n\n# Optional Dependencies\n\nFor advanced media conversion:\n\n- ffmpeg and ffprobe for video/audio conversion. Download: https://www.ffmpeg.org/download.html\n- audiowaveform for audio waveform rendering. Download: https://github.com/bbcrd/audiowaveform\n- ghostscript for PDF import. Download: https://www.ghostscript.com/download/gsdnld.html\n\n# Data Storage\n\nBy default, media files are uploaded to the ```storage``` folder.\nThe database is stored in ```database.sqlite``` by default.\n\n# Hacking\n\nTo rebuild the frontend CSS styles:\n\n    gulp styles\n\n# License\n\nThe Spacedeck logo and brand assets are registered trademarks of Spacedeck GmbH. All rights reserved.\n\nSpacedeck Open source code is released under the GNU Affero General Public License Version 3 (GNU AGPLv3).\n\n    Spacedeck Open - Web-based Collaborative Whiteboard For Rich Media\n    Copyright (C) 2011-2018 Lukas F. Hartmann, Martin Güther\n    Icons and original CSS design copyright by Thomas Helbig\n    \n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as\n    published by the Free Software Foundation, either version 3 of the\n    License, or (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}