{
  "user": "star7th",
  "name": "showdoc",
  "namespace": "star7th",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "ShowDoc is a tool greatly applicable for an IT team to share documents online",
  "is_private": false,
  "is_automated": true,
  "can_edit": false,
  "star_count": 54,
  "pull_count": 439847,
  "last_updated": "2022-12-27T12:41:24.71681Z",
  "date_registered": "2018-08-28T11:52:26.270644Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "star7th",
  "has_starred": false,
  "full_description": "﻿## 中文版教程：https://www.showdoc.com.cn/help \n\n### What is ShowDoc ?\n\nWhenever we take over a module or project which has been developed by other people, we always feel crazy watching at those codes without notes. Where is the document?! Where is the document?! **Show me the doc !!**\n\nA programmer often hopes the others to write technical documents, with the hope of not writing them on his/her own. Because writing a technical document needs a lot of time to handle the format and layout, and the person who writes it has to think of all kinds of non-technical details such as which catalog to put in the newly-established word document\n\nAll kinds of the word documents are kept by different persons in a team dispersedly. The person who needs other documents gets the documents by shouting out. He/She gives a shout asking for the documents and then receives them from other people by IMs or the e-mail. This kind of communication is not bad, but the efficiency is not high.\n\nShowDoc is a tool greatly applicable for an IT team to share documents online. It can promote communication efficiency among members of the team.\n\n### What can it be used for?\n\n- #### API Document （ [Demo](https://www.showdoc.com.cn/demo-en)）\n \n With the development of mobile Internet, BaaS (Backend as a Service) becomes more and more popular. The Server end provides API, and the APP end or Webpage frontend can invoke data conveniently. Using ShowDoc can compile exquisite API documents in a very fast and convenient way.\n\n- #### Data Dictionary （ [Demo](https://www.showdoc.com.cn/demo-en)）\n \n A good Data Dictionary can easily exhibit database structure to other people, such as definition of each field and the like.\n\n- #### Explanation Document （ [Demo](https://www.showdoc.com.cn/help-en)）\n \n You can absolutely use ShowDoc to compile the explanation documents for some tools, as well as to compile some technical specifications explanation documents for the team to look up.\n \n### What functions does it have?\n\n- #### Sharing and Exporting\n\n Responsive webpage design can share the project documents to computer or mobile devices for reading. It can also export the project into word document for browsing offline.\n \n- #### Permission Management\n\n - Public Project and Private Project\n \n   Projects on ShowDoc are divided into two categories including Public Project and Private Project. Public Project can be visited by any user no matter he/she logs in or not, while inputting password for verification is needed for visiting the Private Project. The password is set by project creator. \n   \n  - Project Transfer\n  \n   The project creator can transfer the project to other users of the website freely.\n   \n  - Project Members\n  \n   You can easily add or delete project members in the project of ShowDoc. Members of the project can edit the project, but they can not transfer or delete the project (only creator of the project has the permission).\n   \n- #### Edit Function\n  - Markdown Edit\n  \n   ShowDoc adopts Markdown Editor, and it is excellent both in editing and reading experience. If you know nothing about Markdown, please search “Learning and Introduction of Markdown” on the search engine.\n   \n  - Template Insert\n  \n   On the editing page of ShowDoc, a click on the button which is on the top of the Editor can easily insert API interface template and data dictionary template. After inserting the template, altering data is the only thing that need to do and it reduces a lot of work in editing.\n   \n  - History Version\n  \n   ShowDoc provides a function of History Version on the page, and you can easily restore the page to the former version.\n   \n\n### Deploy It to Your Own Server\n - ShowDoc Deploy\n  \n     Please refer to: [AutoInstall.md](https://github.com/star7th/showdoc/blob/master/documentation/en/AutoInstall.md)\n\n - Development & Contribution\n\n   Please refer to: [Development&Contribution.md](https://github.com/star7th/showdoc/blob/master/documentation/en/Development&Contribution.md)\n\n### Copyright \n\n ShowDoc is issued complying with Apache2 Open Source License, and it is for free use. \n \n Copyright ©  star7th \n \n \n E-mail: xing7th#gmail.com (change # into @) \n \n All rights reserved. \n \n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}