{
  "user": "venueless",
  "name": "venueless",
  "namespace": "venueless",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 3015,
  "last_updated": "2023-01-03T00:27:41.503778Z",
  "date_registered": "2020-05-04T07:28:48.64374Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "venueless",
  "has_starred": false,
  "full_description": "venueless\n=========\n\n.. image:: https://readthedocs.org/projects/venueless/badge/?version=latest\n   :target: https://venueless.readthedocs.io/en/latest/?badge=latest\n   :alt: Documentation Status\n\n.. image:: https://github.com/venueless/venueless/workflows/Server%20tests/badge.svg\n   :target: https://github.com/venueless/venueless/actions\n   :alt: Server tests\n\n.. image:: https://codecov.io/gh/venueless/venueless/branch/master/graph/badge.svg\n  :target: https://codecov.io/gh/venueless/venueless\n\nvenueless allows you to run events fully online. You can make use of different modules including live video streams, interactive video calls, group chats and more.\n\nvenueless is brought to you by `pretix`_, `pretalx`_, and `rash.codes`_.\n\n**This project is in a development stage and requires in-depth technical knowledge for production use.**\n\nLicense\n-------\n\nvenueless is released under the terms of the Business Source License 1.1. See the ``LICENSE`` file for the full\nlicense text as well as the license parameters.\n\nLicense FAQ\n^^^^^^^^^^^\n\nvenueless is not released under an open source license (according to the OSI definition), but an \"eventually open\nsource\" license. While the BSL becomes more common, this is still a rare choice, so we'd like to answer a few\nquestions you might have.\n\nWhat does \"eventually open source\" mean?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nWhile the BSL is not an open source license, it contains a clause that makes sure that the code will automatically be\nre-released under a fully free and open source license (Apache License 2.0 in our case) at a specified change date.\nWith every major update of venueless, we will update this change date to be 24 months in the future starting from\nthe date of that release.\n\nIf you use a version after its change date, you will no longer need to obey the terms of the BSL, but can use the\nproject as if it were licensed with the Apache License.\n\nCan I use venueless for my event for free?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nYes, absolutely! You can set up venueless on a server under your control to host as many events as you like without\nany limitations.\n\nCan I fork and change venueless?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nYes, you are allowed to copy and modify venueless, create derivative works, and redistribute them, as long as you\nobey the license terms and all derived work carries the same restrictions until the change date.\n\nCan I offer a hosted version of venueless to my clients?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nNo, this is basically the only thing you can't do. You can only use venueless for events hosted by your organization,\nbut you can't provide it as a service to other organizations.\n\nCan I integrate parts of venueless in my Open Source Project?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nUnfortunately not. If there's a component you'd like to re-use, please reach out to us and we'll check if we can\nextract that component into a re-usable module that we release under a more permissive license.\n\nAdditionally, you can check if the component was already in venueless in a version on which the BSL has already\nexpired (see above).\n\nAre there other licensing options?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nYes, if you want to use venueless in a way that is not allowed under its license, we are able to provide you with\nadditional licensing options. Please talk to us :)\n\nWhy did you choose the BSL?\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nWe love open source, and we wanted to release this project's source code early on to allow the community to play with\nit and use it for community events for free.\n\nAt the same time, we're trying to build a business model based on the project in order to allow us to spend\nsignificant time resources on its development.\n\nFinding a balance between these two goals is hard, and there's no final solution to the OSS funding problem. In our\nexperience, support contracts alone are not sufficient to fund the development of a project with an audience like\nthis, and we wanted to fully release the whole project instead of going for an \"open core\" model in which we only\nrelease part of it.\n\nTherefore, we've decided to chose providing a Software as a Service offering of this software as our primary business\nmodel, and the BSL allows us to protect ourselves against players with a bigger marketing budget and no interest in\ncontributing back to the project using our work to compete with us directly.\nWe'd like to refer to this `Sentry blogpost`_ for a more in-depth explanation of many reasons behind the choice.\n\nUnlike a more traditional dual licensing approach, the BSL's change date mechanism adds a safeguard against us going\nout of business or just losing interest in the project: If we abandon it, it will automatically fully belong to the\ncommunity.\n\n.. _pretalx: https://pretalx.com\n.. _pretix: https://pretix.eu\n.. _Sentry blogpost: https://blog.sentry.io/2019/11/06/relicensing-sentry\n.. _rash.codes: https://rash.codes/\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}