{
  "user": "wealdtech",
  "name": "chaind",
  "namespace": "wealdtech",
  "repository_type": "image",
  "status": 1,
  "status_description": "active",
  "description": "",
  "is_private": false,
  "is_automated": false,
  "can_edit": false,
  "star_count": 0,
  "pull_count": 1709,
  "last_updated": "2023-01-17T12:18:09.645561Z",
  "date_registered": "2020-09-23T07:30:07.738674Z",
  "collaborator_count": 0,
  "affiliation": null,
  "hub_user": "wealdtech",
  "has_starred": false,
  "full_description": "# chaind\n\n[![Tag](https://img.shields.io/github/tag/wealdtech/chaind.svg)](https://github.com/wealdtech/chaind/releases/)\n[![License](https://img.shields.io/github/license/wealdtech/chaind.svg)](LICENSE)\n[![GoDoc](https://godoc.org/github.com/wealdtech/chaind?status.svg)](https://godoc.org/github.com/wealdtech/chaind)\n![Lint](https://github.com/wealdtech/chaind/workflows/golangci-lint/badge.svg)\n[![Go Report Card](https://goreportcard.com/badge/github.com/wealdtech/chaind)](https://goreportcard.com/report/github.com/wealdtech/chaind)\n\n`chaind` is a process that reads information from an Ethereum 2 beacon node and stores it in a database for reporting and analysis.\n\n## Table of Contents\n\n- [Install](#install)\n  - [Binaries](#binaries)\n  - [Docker](#docker)\n  - [Source](#source)\n- [Usage](#usage)\n- [Maintainers](#maintainers)\n- [Contribute](#contribute)\n- [License](#license)\n\n## Install\n\n### Binaries\n\nBinaries for the latest version of `chaind` can be obtained from [the releases page](https://github.com/wealdtech/chaind/releases/latest  ).\n\n### Docker\n\nYou can obtain the latest version of `chaind` using docker with:\n\n```\ndocker pull wealdtech/chaind\n```\n\n### Source\n\n`chaind` is a standard Go binary which can be installed with:\n\n```sh\nGO111MODULE=on go get github.com/wealdtech/chaind\n```\n\n## Usage\nData gathers four pieces of information from the beacon node, broken down by the modules that obtain the information:\n\n  - **Proposer duties** The proposer duties module provides information on the validator expected to propose a beacon block at a given slot;\n  - **Beacon committees** The beacon committees module provides information on the validators expected to attest to a beacon block at a given slot;\n  - **Validators** The validators module provides information on the current statue of validators.  It can also obtain information on the validators' balances and effective balances at a given epoch;\n  - **Blocks** The blocks module provides information on blocks proposed for each slot.  This includes:\n    - the block structure\n    - attestations\n    - proposer slashings\n    - attester slashings\n    - deposits\n    - voluntary exits; and\n  - **Ethereum 1 deposits** The Ethereum 1 deposits module provides information on deposits made on the Ethereum 1 network;\n  - **Finalizer** The finalizer module augments the information present in the database from finalized states.  This includes:\n    - the canonical state of blocks.\n\nIn addition, the summarizer module takes the finalized information and generates summary statistics at the validator, block and epoch level.\n\n## Requirements to run `chaind`\n### Database\nAt current the only supported backend is PostgreSQL.  Once you have a  PostgreSQL instance you will need to create a user and database that `chaind` can use, for example run the following commands as the PostgreSQL superuser (`postgres` on most linux installations):\n\n```\n# This command creates a user named 'chain' and will prompt for a password.\ncreateuser chain -P\n# This command creates a database named 'chain' owned by the 'chain' user.\ncreatedb -E UTF8 --owner=chain chain\n```\n\n### Beacon node\n`chaind` supports Teku and Lighthouse beacon nodes.  The current state of obtaining data from beacon nodes is as follows:\n\n  - Teku: must be run in [archive mode](https://docs.teku.consensys.net/en/latest/Reference/CLI/CLI-Syntax/#data-storage-mode) to allow `chaind` to obtain historical data\n  - Lighthouse: Make sure to run with `--slots-per-restore-point 64`, else fetching historical information will be **very** slow. For more information on the trade off between Freezer DB size and fetching performance, please refer to [Database Configuration](https://lighthouse-book.sigmaprime.io/advanced_database.html) in the Lighthouse Book.\n\nAt current Prysm is not supported due to its lack of Altair-related information in its gRPC and HTTP APIs.  We expect to be able to support Prysm again soon.\n\n`chaind` supports all execution nodes.  The current state of obtaining data from execution nodes is as follows:\n\n  - geth: must run with `--txlookuplimit 0` to ensure that all deposit transactions can be obtained\n\n### Example\nTo start a Teku node suitable for `chaind` download Teku and run the following command:\n\n```sh\nteku --rest-api-enabled --data-storage-mode=archive\n```\n\nOnce Teku has finished syncing, run:\n\n```sh\nchaind --eth2client-address=http://localhost:5051/\n```\n\n## Upgrading `chaind`\n`chaind` should upgrade automatically from earlier versions.  Note that the upgrade process can take a long time to complete, especially where data needs to be refetched or recalculated.  `chaind` should be left to complete the upgrade, to avoid the situation where additional fields are not fully populated.  If this does occur then `chaind` can be run with the options `--blocks.start-slot=0 --blocks.refetch=true` to force `chaind` to refetch all blocks.\n\n## Querying `chaind`\n`chaind` attempts to lay its data out in a standard fashion for a SQL database, mirroring the data structures that are present in Ethereum 2.  There are some places where the structure or data deviates from the specification, commonly to provide additional information or to make the data easier to query with SQL.  It is recommended that the [notes on the tables](docs/tables.md) are read before attempting to write any complicated queries.\n\n## Configuring `chaind`\nThe minimal requirements for `chaind` are references to the database and beacon node, for example:\n\n```\nchaind --chaindb.url=postgres://chain:secret@localhost:5432 --eth2client.address=localhost:5051\n```\n\nHere, `chaindb.url` is the URL of a local PostgreSQL database with password 'secret' and 'eth2client.address' is the address of a supported beacon client node (gRPC for Prysm, HTTP for Teku and Lighthouse).\n\n`chaind` allows additional configuration for itself and its modules.  It takes configuration from the command line, environment variables or a configuration file, but for the purposes of explaining the configuration options the configuration file is used.  This should be in the home directory and called `.chaind.yml`.  Alternatively, the configuration file can be placed in a different directory and referenced by `--base-dir`, for example `--base-dir=/home/user/config/chaind`; in this case the file should be called `chaind.yml` (without the leading period).\n\n```\n# log-level is the base log level of the process.\n# 'info' should be a suitable log level, unless detailed information is\n# required in which case 'debug' or 'trace' can be used.\nlog-level: info\n# log-file specifies that log output should go to a file.  If this is not\n# present log output will be to stderr.\nlog-file: /var/log/chaind.log\nchaindb:\n  # url is the URL of the PostgreSQL database.\n  url: postgres://chain:secret@localhost:5432\n  max-connections: 16\n# eth2client contains configuration for the Ethereum 2 client.\neth2client:\n  # log-level is the log level of the specific module.  If not present the base log\n  # level will be used.\n  log-level: debug\n  # address is the address of the beacon node.\n  address: localhost:5051\n# eth1client contains configuration for the Ethereum 1 client.\neth1client:\n  # address is the address of the Ethereum 1 node.\n  address: localhost:8545\n# blocks contains configuration for obtaining block-related information.\nblocks:\n  # enable states if this module will be operational.\n  enable: true\n  # address is a separate connection for this module.  If not present then\n  # chaind will use the eth2client connection.\n  address: localhost:5051\n  # start-slot is the slot from which to start.  chaind should keep track of this itself,\n  # however if you wish to start from a later slot this can be set.\n  # start-slot: 2000\n  # refetch will refetch block data from a beacon node even if it has already has a block\n  # in its database.\n  # refetch: false\n# validators contains configuration for obtaining validator-related information.\nvalidators:\n  enable: true\n  # balances contains configuration for obtaining validator balances.  This is\n  # a separate configuration flag for two reasons.  First, it can take a long\n  # time to retrieve this information.  Second, the information can be\n  # derived from the data obtained by the other modules.\n  balances:\n    enable: false\n# beacon-committees contains configuration for obtaining beacon committee-related\n# information.\nbeacon-committees:\n  enable: true\n# proposer-duties contains configuration for obtaining proposer duty-related\n# information.\nproposer-duties:\n  enable: true\n# finalizer updates tables with information available for finalized states.\nfinalizer:\n  enable: true\n# eth1deposits contains information about transactions made to the deposit contract\n# on the Ethereum 1 network.\neth1deposits:\n  enable: false\n  # start-block is the block from which to start fetching deposits.  chaind should\n  # keep track of this itself, however if you wish to start from a different block this\n  # can be set.\n  # start-block: 500\n```\n\n## Support\n\nWe gratefully acknowledge the Ethereum Foundation for supporting chaind through their grant FY21-0360, which allowed collection of Ethereum 1 deposits.\n\n## Maintainers\n\nJim McDonald: [@mcdee](https://github.com/mcdee).\n\n## Contribute\n\nContributions welcome. Please check out [the issues](https://github.com/wealdtech/chaind/issues).\n\n## License\n\n[Apache-2.0](LICENSE) © 2020 Weald Technology Trading.\n",
  "permissions": {
    "read": true,
    "write": false,
    "admin": false
  },
  "media_types": [
    "application/vnd.docker.container.image.v1+json"
  ],
  "content_types": [
    "image"
  ]
}