{
  "startTime": 1674250898321,
  "endTime": 1674250898370,
  "originalSmells": [
    {
      "rule": "pipUseNoCacheDir",
      "position": {
        "lineStart": 47,
        "lineEnd": 47,
        "columnStart": 4,
        "columnEnd": 40
      }
    }
  ],
  "repairedSmells": [],
  "repairedDockerfile": "#  Copyright 2018 Synthego Corporation All Rights Reserved\n#\n#  The Synthego ICE software was developed at Synthego Corporation.\n#\n#  Permission to use, copy, modify and distribute any part of Synthego ICE for\n#  educational, research and non-profit purposes, without fee, and without a\n#  written agreement is hereby granted, provided that the above copyright notice,\n#  this paragraph and the following paragraphs appear in all copies.\n#\n#  Those desiring to incorporate this Synthego ICE software into commercial\n#  products or use for commercial purposes should contact Synthego support at Ph:\n#  (888) 611-6883 ext:1, E-MAIL: support@synthego.com.\n#\n#  In no event shall Synthego Corporation be liable to any party for direct,\n#  indirect, special, incidental, or consequential damages, including lost\n#  profits, arising out of the use of Synthego ICE, even if Synthego Corporation\n#  has been advised of the possibility of such damage.\n#\n#  The Synthego ICE tool provided herein is on an \"as is\" basis, and the Synthego\n#  Corporation has no obligation to provide maintenance, support, updates,\n#  enhancements, or modifications. The Synthego Corporation makes no\n#  representations and extends no warranties of any kind, either implied or\n#  express, including, but not limited to, the implied warranties of\n#  merchantability or fitness for a particular purpose, or that the use of\n#  Synthego ICE will not infringe any patent, trademark or other rights.\n\n#  Synthego ICE\n\nFROM continuumio/miniconda3\n\nMAINTAINER support@synthego.com\n\nRUN echo 'Building SYNTHEGO ICE docker environment'\nRUN echo 'For more information, visit https://github.com/synthego-open/ice'\n\nENV PYTHONPATH $PYTHONPATH:/ice\n\n# Install python dependencies\n\nRUN conda install -y -c numpy scipy pandas matplotlib biopython\n\nADD . /ice\n\n# clear any local pyc files (can interfere with tests)\nRUN find /ice -name \\*.pyc -delete\n\nRUN pip install --no-cache-dir -r /ice/requirements.txt\n"
}