{
  "startTime": 1674243585449,
  "endTime": 1674243585479,
  "originalSmells": [
    {
      "rule": "pipUseNoCacheDir",
      "position": {
        "lineStart": 8,
        "lineEnd": 8,
        "columnStart": 4,
        "columnEnd": 34
      }
    },
    {
      "rule": "pipUseNoCacheDir",
      "position": {
        "lineStart": 9,
        "lineEnd": 9,
        "columnStart": 4,
        "columnEnd": 75
      }
    }
  ],
  "repairedSmells": [],
  "repairedDockerfile": "FROM python:2-alpine\n\n# A docker file to make a portable ansible image\n\nENV ANSIBLE=2.5.2\nWORKDIR /ansible\n\nRUN apk --no-cache add sudo gcc musl-dev libffi-dev openssl-dev make\nRUN pip install --no-cache-dir --upgrade pip cffi\nRUN pip install --no-cache-dir netaddr boto3 botocore awscli docker-py ansible==${ANSIBLE}\nADD ansible.cfg /etc/ansible/\n\n##################################################################################\n# The MIT License (MIT)                                                          #\n#                                                                                #\n# Copyright (c) 2014 Neil H Watson                                               #\n#                                                                                #\n# Permission is hereby granted, free of charge, to any person obtaining a copy   #\n# of this software and associated documentation files (the \"Software\"), to deal  #\n# in the Software without restriction, including without limitation the rights   #\n# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell      #\n# copies of the Software, and to permit persons to whom the Software is          #\n# furnished to do so, subject to the following conditions:                       #\n#                                                                                #\n# The above copyright notice and this permission notice shall be included in all #\n# copies or substantial portions of the Software.                                #\n#                                                                                #\n# THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR     #\n# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,       #\n# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE    #\n# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER         #\n# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,  #\n# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE  #\n# SOFTWARE.                                                                      #\n##################################################################################\n"
}