{
  "startTime": 1674236398991,
  "endTime": 1674236399088,
  "originalSmells": [
    {
      "rule": "aptGetInstallThenRemoveAptLists",
      "position": {
        "lineStart": 35,
        "lineEnd": 44,
        "columnStart": 4,
        "columnEnd": 22
      }
    }
  ],
  "repairedSmells": [],
  "repairedDockerfile": "# Copyright (c) 2019, NVIDIA CORPORATION. All rights reserved.\n#\n# Redistribution and use in source and binary forms, with or without\n# modification, are permitted provided that the following conditions\n# are met:\n#  * Redistributions of source code must retain the above copyright\n#    notice, this list of conditions and the following disclaimer.\n#  * Redistributions in binary form must reproduce the above copyright\n#    notice, this list of conditions and the following disclaimer in the\n#    documentation and/or other materials provided with the distribution.\n#  * Neither the name of NVIDIA CORPORATION nor the names of its\n#    contributors may be used to endorse or promote products derived\n#    from this software without specific prior written permission.\n#\n# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY\n# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\n# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\n# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n# Default setting is building on ubuntu:16.04\nARG UBUNTU_VERSION=16.04\n\nFROM ubuntu:${UBUNTU_VERSION}\n\n# Ensure apt-get won't prompt for selecting options\nENV DEBIAN_FRONTEND=noninteractive\n\nRUN apt-get update && \\\n    apt-get install -y --no-install-recommends \\\n            software-properties-common \\\n            build-essential \\\n            cmake \\\n            git \\\n            libopencv-dev \\\n            libopencv-core-dev \\\n            libssl-dev \\\n            libtool \\\n            pkg-config && rm -rf /var/lib/apt/lists/*;\n\n# Build the custom backend library and example custom backends\nWORKDIR /workspace\nCOPY VERSION VERSION\nCOPY build build\nCOPY src/backends/custom/custom.h src/backends/custom/custom.h\nCOPY src/custom src/custom\nCOPY src/core src/core\n\n# The build can fail the first time due to a protobuf_generate_cpp\n# error that doesn't repeat on subsequent builds, which is why there\n# are 2 make invocations below.\nRUN (cd build && \\\n            cmake -DTRTIS_ENABLE_GPU=OFF \\\n                  -DCMAKE_BUILD_TYPE=Release \\\n                  -DCMAKE_INSTALL_PREFIX:PATH=/workspace/install/custom-backend-sdk && \\\n            (make -j16 trtis-custom-backends || true) && \\\n            make -j16 trtis-custom-backends) && \\\n    export VERSION=`cat /workspace/VERSION` && \\\n    (cd install && tar zcf /workspace/v$VERSION.custombackend.tar.gz custom-backend-sdk)\n"
}