{
  "startTime": 1674249072681,
  "endTime": 1674249072702,
  "originalSmells": [
    {
      "rule": "pipUseNoCacheDir",
      "position": {
        "lineStart": 32,
        "lineEnd": 32,
        "columnStart": 4,
        "columnEnd": 40
      }
    }
  ],
  "repairedSmells": [],
  "repairedDockerfile": "# Copyright 2015 Google Inc.\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#     http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License\n\n# The Google App Engine python runtime is Debian Jessie with Python installed\n# and various os-level packages to allow installation of popular Python\n# libraries. The source is on github at:\n#   https://github.com/GoogleCloudPlatform/python-docker\nFROM gcr.io/google_appengine/python\n\n# Create a virtualenv for the application dependencies.\n# If you want to use Python 3, add the -p python3.4 flag.\nRUN virtualenv /env\n\n# Set virtualenv environment variables. This is equivalent to running\n# source /env/bin/activate. This ensures the application is executed within\n# the context of the virtualenv and will have access to its dependencies.\nENV VIRTUAL_ENV /env\nENV PATH /env/bin:$PATH\n\n# Install dependencies.\nADD requirements.txt /app/requirements.txt\nRUN pip install --no-cache-dir -r /app/requirements.txt\n\n# Uncomment the following line to use NODB\n# NODB will use SQLite and in-memory cache insstead of Postgres And Redis\n# This is useful to test the rest of the Django setup without configuring the database/cache\n# Comment it out and rebuild this image once you have Postgres and Redis services in your cluster\n#ENV NODB 1\n\n# Add application code.\nADD . /app\n\nCMD export DJANGO_PASSWORD=$(cat /etc/secrets/djangouserpw); gunicorn -b :$PORT mysite.wsgi\n"
}