{
  "startTime": 1674246313150,
  "endTime": 1674246313360,
  "originalSmells": [
    {
      "rule": "yumInstallRmVarCacheYum",
      "position": {
        "lineStart": 18,
        "lineEnd": 24,
        "columnStart": 4,
        "columnEnd": 9
      }
    }
  ],
  "repairedSmells": [],
  "repairedDockerfile": "# Licensed to the Apache Software Foundation (ASF) under one\n# or more contributor license agreements.  See the NOTICE file\n# distributed with this work for additional information\n# regarding copyright ownership.  The ASF licenses this file\n# to you under the Apache License, Version 2.0 (the\n# \"License\"); you may not use this file except in compliance\n# with the License.  You may obtain a copy of the License at\n#\n#     http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\nFROM centos:6.6\n\n# Install useful things that are missing from the centos:6.6 image.\nRUN yum install -y openssh-clients \\\n    openssh-server \\\n    rsyslog \\\n    sudo \\\n    tar \\\n    wget \\\n    which && rm -rf /var/cache/yum\n\n# Add pre-created SSH keys into .ssh folder.\nADD ssh /root/.ssh/\n\n# Copy public key into authorized_keys and limit access to the private key to ensure SSH can use it.\nRUN cp /root/.ssh/id_rsa.pub /root/.ssh/authorized_keys && \\\n    chmod 600 /root/.ssh/id_rsa\n\n# The official CentOS Docker images retain a lot of things that only apply on a real machine.\n# Among the most problematic is starting udev, which was seen to hang when containers were started\n# simultaneously. Simple solution (and one done by the lxc-centos.in template) is to simply\n# not trigger it. The other is the inclusion of the 90-nproc.conf file, which overrides reasonable\n# defaults for things like the maximum number of user processes when running commands as a non-root\n# user. Get rid of it (and see tinyurl.com/zqdfzpg).\nRUN sed -i 's|/sbin/start_udev||' /etc/rc.d/rc.sysinit && \\\n    rm /etc/security/limits.d/90-nproc.conf\n\n# Disable strict host key checking and set the known hosts file to /dev/null to make\n# SSH between containers less of a pain.\nRUN sed -i -r \"s|\\s*Host \\*\\s*|&\\n        StrictHostKeyChecking no|\" /etc/ssh/ssh_config && \\\n    sed -i -r \"s|\\s*Host \\*\\s*|&\\n        UserKnownHostsFile=/dev/null|\" /etc/ssh/ssh_config\n\nCMD [\"/sbin/init\"]\n"
}